{"songs": [{"title": "Comin Out Strong", "album": "HNDRXX", "year": "2017-02-24", "lyrics": "[Intro]\nHigh Klassified な音楽\nI got the truth in me, baby!\n\n[Verse 1: The Weeknd]\nLike a nigga don't dance, but he make moves\nThey fuck around, now a nigga gotta shame you\nI'm shameless, I be rockin' all my chains too\nThey told me, \"Boy I think the money's startin' to change you\"\nLord save you, Lord save you\n'Member runnin' through the city in the same shoes\nNow I'm gunnin' in the Benz and the Range too\nI'm on point, know a nigga never take two\nThey said I couldn't reach Mars, so I turned to a star\nNow I might have fucked around, might have raised up the bar\nNow I'm talkin' cash, talk cash all in my palm\nMy nigga Cash said, \"Watch what they do for the ones\"\nI know she wanna be poppin' all over the 'Gram\nWhen the cameras come out, wanna hold my hand\nMust be out of your mind, do you know who I am?\nMan you're killin' my vibe, do you know who I am?\nOh yeah\n\n[Chorus: The Weeknd]\nThey take my kindness for weakness\nStill comin' out strong\nStill comin' out strong\nStill comin' out strong\nTake my kindness for weakness\nStill comin' out strong\nStill comin' out strong\nStill comin' out strong\n\n[Verse 2: Future]\nI might end up with your ho if I take one\nNowdays if they don't have a story, they gon' make one\nLast night I gave my heart to a fake one\nI done end up on the blogs with the wrong one\nIt's hard to tell the real stories from the fake ones\n'Cause nowdays if they don't got it they'll make one\nThe only time I feel alive when I take (still comin')\nI want a Vic but I know it ain't safe\nMust be out of your mind, do you know who I am?\nUsed to hit it from behind, do you know who I am? (never say my name)\nI can't give you all my time, do you know who I am?\nMake you fall in love tonight, must don't know who I am, I am\nI showed you a million, no videos (no videos)\nI opened up Bentley doors, I invented doors (invented)\nBodies droppin' and we duckin' the law\nIf you the one to take the blame, you can't say what you saw, no\n\n[Chorus: The Weeknd]\nThey take my kindness for weakness\nStill comin' out strong\nStill comin' out strong\nStill comin' out strong\nTake my kindness for weakness\nStill comin' out strong\nStill comin' out strong\nStill comin' out strong\n\n[Verse 3: Future]\nPluto don't dance, but I make moves\nWe fucked around, now a nigga gotta shame you\nShameless, I've been rockin' all my chains too\nTold me, \"Boy I think the money startin' to change you\"\nLord save you, Lord save you\nThey might pick you up, just throw you down with the fall\nYou must not know who I am\nYou must not know who I am\nI pour champagne on the ground\nI pour champagne on the ground\nMy brother Casino said you wasn't Freebandz (Freebandz)\nAnd at the time I couldn't see what he was sayin' (he was sayin')\nYou turned your back, I should have never gave you chances (gave you chances)\nI call for loyalty, she didn't never answer\nI'm a boss, I'ma make my own family (la familia)\nYou're with my ex, while I'm with different color candies\n(so familiar)\nI got Jenny, I got Tammy, I got Sandy\nYou try to sneak and leave 'em then I leave you stranded\nBe honest to me\n\n[Chorus: The Weeknd & Future]\nThey take my kindness for weakness\nStill comin' out strong\nStill comin' out strong\nStill comin' out strong\nBe honest to me\nTake my kindness for weakness\nStill comin' out strong\nStill comin' out strong\nStill comin' out strong\n\n[Outro: The Weeknd & Future]\nKindness, she lie\nStill comin', lie\nBoss, fuck around, boss\nKindness\nDown, like a nigga, she lie\nKindness, she lie\nKindness, oh", "image": "https://images.genius.com/a3334b3b040c2c12cf716402693c55af.1000x1000x1.jpg"}], "artist": "Future"}