{"songs": [{"title": "The World Is Yours", "album": "Illmatic", "year": "1994-05-31", "lyrics": "[Produced by Pete Rock]\n\n[Chorus: Pete Rock + Nas]\n(It's yours)\nWhose world is this?\nThe world is yours, the world is yours\nIt's mine, it's mine, it's mine—whose world is this?\n(It's yours)\nIt's mine, it's mine, it's mine—whose world is this?\nThe world is yours, the world is yours\nIt's mine, it's mine, it's mine—whose world is this?\n\n[Verse 1: Nas]\nI sip the Dom P, watchin' Gandhi 'til I'm charged, then\nWritin' in my book of rhymes, all the words past the margin\nBehold the mic I'm throbbin', mechanical movement\nUnderstandable smooth shit that murderers move with\nThe thief's theme, play me at night, they won't act right\nThe fiend of hip-hop has got me stuck like a crack pipe\nThe mind activation, react like I'm facin'\nTime like Pappy Mason, with pens I'm embracin'\nWipe the sweat off my dome, spit the phlegm on the streets\nSuede Timbs on my feet makes my cipher complete\nWhether cruisin' in a Six cab or Montero Jeep\nI can't call it, the beats make me fallin' asleep\nI keep fallin', but never fallin' six feet deep\nI'm out for presidents to represent me (Say what?)\nI'm out for presidents to represent me (Say what?)\nI'm out for dead presidents to represent me\n\n[Chorus: Pete Rock + Nas]\nWhose world is this?\nThe world is yours, the world is yours\nIt's mine, it's mine, it's mine—whose world is this?\nThe world is yours, the world is yours\nIt's mine, it's mine, it's mine—whose world is this?\n(It's yours)\nIt's mine, it's mine, it's mine—whose world is this?\nThe world is yours, the world is yours\nIt's mine, it's mine, it's mine—whose world is this?\n\n[Verse 2: Nas]\nTo my man Ill Will\nGod bless your life\nTo my peoples throughout Queens\nGod bless your life\nI trip, we box up crazy bitches\nAimin' guns in all my baby pictures\nBeef with housing police, release scriptures that's maybe Hitler's\nYet I'm the mild, money-gettin' style, rollin' foul\nThe versatile, honey-stickin', wild, golden child\nDwellin' in the Rotten Apple, you get tackled\nOr caught by the devil's lasso, shit is a hassle\nThere's no days for broke days\nWe sell it, smoke pays, while all the old folks pray\nTo Jesús, soakin' their sins in trays of holy water\nOdds against Nas are slaughter\nThinkin' a word best describin' my life to name my daughter\nMy strength, my son, the star will be my resurrection\nBorn in correction, all the wrong shit I did\nHe'll lead a right direction\nHow you livin'? Large, a broker charge, cards are mediocre\nYou flippin' coke or playin' spit, spades, and strip poker?\n\n[Chorus: Pete Rock + Nas]\n(It's yours)\nIt's mine, it's mine, it's mine—whose world is this?\nThe world is yours, the world is yours\nIt's mine, it's mine, it's mine—whose world is this?\n(It's yours)\nIt's mine, it's mine, it's mine—whose world is this?\nYo, the world is yours, the world is yours\nIt's mine, it's mine, it's mine—whose world is this?\n(It's yours)\n\n[Bridge]\nBreak it down\nIt's yours, it's yours\nIt's yours, it's yours\n\n[Verse 3: Nas]\nI'm the young city bandit, hold myself down single-handed\nFor murder raps, I kick my thoughts alone, get remanded\nBorn alone, die alone, no crew to keep my crown or throne\nI'm deep by sound alone, caved inside, 1,000 miles from home\nI need a new nigga for this black cloud to follow\n‘Cause while it's over me it's too dark to see tomorrow\nTryin' to maintain, I flip, fill the clip to the tip\nPicturin' my peeps not eatin' can make my heartbeat skip\nAnd I'm amped up, they locked the champ up\nEven my brain's in handcuffs\nHeaded for Indiana, stabbin' women like the Phantom\nThe crew is lampin', Big Willie style\nCheck the chip-toothed smile, plus I profile wild\nStash loot in fly clothes, burnin' dollars to light my stoge\nWalk the blocks with a bop, checkin' dames\nPlus the games people play bust the problems of the world today\n\n[Chorus: Pete Rock + Nas]\n(It's yours)\nIt's mine, it's mine, it's mine—whose world is this?\nThe world is yours, the world is yours\nIt's mine, it's mine, it's mine—whose world is this?\n(It's yours)\nThe world is yours, the world is yours\nIt's mine, it's mine, it's mine—whose world is this?\n(It's yours)\nYeah, the world is yours, the world is yours\nIt's mine, it's mine, it's mine—whose world is this?\n(It's yours)\n\n[Outro: Nas]\nYeah, a'ight?\nTo everybody in Queens, the foundation (It's yours!)\nThe world is yours\nTo everybody uptown, yo, the world is yours (It's yours!)\nThe world is yours\nTo everybody in Brooklyn\nY'all know the world is yours (It's yours!)\nThe world is yours\nEverybody in Mount Vernon, the world is yours (It's yours!)\nLong Island, the world is yours (It's yours!)\nStaten Island, yeah, the world is yours (It's yours!)\nSouth Bronx, the world is yours (It's yours!)\nAight", "image": "https://images.genius.com/607f57e6a9c537bbdbf0a3cc05f7b606.730x730x1.jpg"}], "artist": "Nas"}