{"songs": [{"title": "Don't Like.1", "album": "Kanye West Presents Good Music Cruel Summer", "year": "2012-09-14", "lyrics": "[Produced by Young Chop; co-production by Kanye West, Noah Goldstein, and The Twilite Tone]\n\n[Verse 1: Pusha T]\nFraud niggas, y'all niggas, that's that shit I don't like\nYour shit make-believe, rappin' about my own life\nReal names kill things, that's that shit I won't write\n'Cause my niggas still sellin' dope\nLike they ain't on their third strikes\nCampin' out in that corridor, fuck you waitin' on Jordans for?\nI middle-man it for twenty-three\nJust meet me somewhere 'round Baltimore\n(Woo!) That's rare, nigga (Woo!) Ric Flair, nigga\n(Woo!) The power's in my hair, nigga\n(Woo!) I give this beat the chair, nigga\nSoHo or Tribeca, three hoes: trifecta\nDope money, hope money, Hublot, my watch better\nMy pen's better, you don't write, trendsetter, you clone-like\nPay homage or K's vomit, ungrateful niggas I don't like—rrrah!\n\n[Chorus: Chief Keef (Pusha T)]\nA fuck nigga, that's that shit I don't like (bang bang)\nA snitch nigga, that's that shit I don't like (bang bang)\nA bitch nigga, that's that shit I don't like (bang bang, haha!)\nSneak disser, that's that shit I don't like\n(This Chicago, nigga!)\n\n[Verse 2: Kanye West]\nA smile in my face is what I don't like\nThey steal your whole sound: that's a soundbite\nThe media crucify me like they did Christ\nThey want to find me not breathin' like they found Mike\n(Whoa-oh-oh) A girl'll run her mouth only out of spite\n(Whoa-oh-oh) But I'd never hit a woman, never in my life\n(Ayy!) I was in too deep like Mekhi Phife'\n(Ayy!) In that pussy so deep I could have drowned twice\n(Whoa-oh-oh) Rose gold Jesus piece with the brown ice\n(Whoa-oh-oh) Eatin' good: vegetarian with the brown rice\n(Ayy!) Girls kissin' girls, ‘cause it's hot, right?\n(Ayy!) But unless they use a strap-on, then they not dykes\n(Whoa-oh-oh) They ain't about that life, they ain't about that life\n(Whoa-oh-oh) We hangin' out the window: it's about to be a Suge night\n(Ayy!) Free Bump J, real nigga for life\n(Ayy!) Shoutout to Derrick Rose, man, that nigga nice\n(Whoa-oh-oh) Shoutout to L.E.P., Jay Boogie, right?\n(Whoa-oh-oh) Chief Keef, King Louie, this is Chi, right? Right?!\n\n[Chorus: Chief Keef]\nA fuck nigga, that's that shit I don't like (right now)\nA snitch nigga, that's that shit I don't like (right now)\nA bitch nigga, that's that shit I don't like (right now)\nSneak disser, that's that shit I don't like\nDon't like (like) don't like (right now)\nA snitch nigga, that's that shit I don't like\n(Young Chop on the beat)\n\n[Verse 3: Chief Keef]\nFake Gucci, that's that shit that I don't like (nah, nah)\nSmokin' on this dope, higher than a kite\nThis bitch gon' love me now, she gon' let me pipe (nah)\nScreamin', \"Sosa, that's that nigga that I like!\" (Sosa)\nI don't want relations, I just want one night (one night)\n‘Cause a thirsty bitch, that's the shit that I don't like (nah)\nI got tats up on my arm ‘cause this shit is life (that's life, tatted)\nAnd I stunt so much in clothes ‘cause I'm livin' life (life)\nI come up on the scene, and I'm stealin' light\nBitch, I'm high off life, got me feelin' right (300)\nBitch, I'm Chief Keef, fuck who don't like!\nAn-an-and bitch, we GBE, we just go on sight\n\n[Chorus: Chief Keef & Big Sean]\nA fuck nigga, that's that shit I don't like (right now)\nA snitch nigga, that's that shit I don't like (right now)\nA bitch nigga, that's that shit I don't like (right now)\nSneak disser, that's that shit I don't like\nChief Keef, Chi-Town, D-Town, you know?\n\n[Verse 4: Big Sean]\nWhoa, we are not one and the same\nNigga, I'm fuckin' insane, fuck is you sayin'?\nYo' ass been doin' the same\nShit, not doin' what you sayin', dang\nI told yo' old bitch she was fuckin' a lame\nTurn one ho to a train\nBlaow, blang, my niggas holdin' that pain\nI just hope you been prayin'—bang bang!\nRidin' for my niggas and that's for life\nHigh class, I'm just surrounded by these lowlives\nAnd I run this bitch like it's no lights\nGoin' hard the whole night 'cause I ain't goin' back to my old life\nI promise\n\n[Chorus: Chief Keef & Jadakiss]\nA fuck nigga, that's that shit I don't like (right now!)\nA snitch nigga, that's that shit I don't like (nah!)\nA bitch nigga, that's that shit I don't like (right now!)\nSneak disser, that's that shit I don't like\nHEEEEH!\n\n[Verse 5: Jadakiss]\nI done sold purp (purple), I done sold white (white)\nRunnin' outta work, that's that shit I don't like (nah)\nShe never let me hit it (nah), she gave me dome twice (haha)\nShe blowin' up my phone, that's that bitch I don't like\nNah, jean jacket with the sleeves cut\nPut the pressure on 'em, just when they think that I eased up\nThirty for the Cuban, 'nother thirty for the Jesus (uh-huh)\nBelieve in ourselves when nobody else believed us, suckas!\n\n[Chorus: Chief Keef]\nA fuck nigga, that's that shit I don't like (bang bang)\nA snitch nigga, that's that shit I don't like (bang bang)\nA bitch nigga, that's that shit I don't like (bang bang)\nSneak disser, that's that shit I don't like", "image": "https://images.genius.com/32b64d1f75874fafbc1a0e963ab57b75.1000x1000x1.jpg"}], "artist": "Kanye West"}