{"songs": [{"title": "Represent", "album": "Illmatic", "year": "1994-04-19", "lyrics": "[Produced by DJ Premier]\n\n[Chorus]\nRepresent, represent\nRepresent, represent\nRepresent, represent\nRepresent, represent\n\n[Verse 1]\nStraight up, shit is real\nAnd any day could be your last in the jungle\nGet murdered on a humble, guns'll blast, niggas tumble\nThe corners is the hot spot, full of mad criminals\nWho don't care, guzzling beers, we all stare\nAt the out-of-towners\n(Ay, yo, yo, who that?), they better break North\nBefore we get the four pounders and take their face off\nThe streets is filled with undercovers\nHomicide chasing brothers\nThe D's on the roof tryin' to watch us and knock us\nAnd killer coppers even come through in helicopters\nI drink a little vodka, spark a L and hold a Glock\nFor the fronters, wannabe ill niggas and spot runners\nThinking it can't happen 'til I trap 'em and clap 'em\nAnd leave 'em done, won't even run about gods\nI don't believe in none of that shit, your facts are backwards\nNas is a rebel of the street corner\nPulling a TEC out the dresser; police got me under pressure\n\n[Chorus]\nRepresent, represent\nRepresent, represent\nRepresent, represent\nRepresent, represent\n\n[Verse 2]\nYo, they call me Nas, I'm not your legal type of fella\nMoët drinking, marijuana smoking street dweller\nWho's always on the corner, rolling up blessed\nWhen I dress, it's never nothing less than Guess\nCold be walking with a bop and my hat turned back\nLove committing sins and my friends sell crack\nThis nigga raps with a razor, keep it under my tongue\nThe school drop-out, never liked the shit from day one\n‘Cause life ain't shit but stress, fake niggas, and crab stunts\nSo I guzzle my Hennessy while pulling on mad blunts\nThe brutalizer, crew de-sizer, accelerator\nThe type of nigga who be pissing in your elevator\nSomehow the rap game reminds me of the crack game\nUsed to sport Bally's and Cazals with black frames\nNow I'm into fat chains, sex and TECs\nFly new chicks and new kicks, Heines and Beck's\n\n[Chorus]\nRepresent, represent\nRepresent, represent\nRepresent, represent\n\n[Verse 3]\nNo doubt, see my stacks are fat, this is what it's about\nBefore the BDP conflict with MC Shan\nAround the time when Shante dissed the Real Roxanne\nI used to wake up every morning, see my crew on the block\nEvery day's a different plan that had us running from cops\nIf it wasn't hanging out in front of cocaine spots\nWe was at the candy factory, breaking the locks\nNowadays, I need the green in a flash just like the next man\nFuck a yard, God, let me see a hundred grand\nCould use a gun, son, but fuck being the wanted man\nBut if I hit rock bottom then I'ma be the Son of Sam\nThen call the crew to get live too, with Swoop\nBokeem, my brother Jungle, Big Bo cooks up the blow\nMike'll chop it; Mayo, you count the profit\nMy shit is on the streets, this way the Jakes'll never stop it\nIt's your brain on drugs, to all fly bitches and thugs\n'Nuff respect to the projects, I'm ghost, one love\n\n[Chorus]\nRepresent y'all, represent\nRepresent y'all, represent\nRepresent y'all, represent\nRepresent y'all, represent\n\n[Outro]\nOne time for your mothafuckin' mind\nThis goes out to everybody in New York\nThat's living the real fucking life and every projects, all over\nTo my man Big Will, he's still here\nThe 40 side of Vernon, my man Big L.E.S\nBig Cee-Lo from the Don, Shawn Penn, the 40 busters\nMy crew the shorty busters, the 41st side of Vernon posse\nThe Goodfellas, my man Cormega, Lakey the Kid\nCan't forget Draws, the Hillbillies\nMy man Slate, Wallethead, Black Jay, Big Oogie\nCrazy barrio spot, (Big Dove), we rock shit a lot, PHD\nAnd my man Premo from Gang Starr\n'94 real shit y'all (word up Harry O)\nFuck y'all crab-ass niggas though!\n\n[Nas' posse]\nBitch ass niggas! Bitch ass niggas!\nYoung bitch ass motherfuckers!\nCome to Queensbridge, motherfucker!\nYeah, yeah, let's bring it back\nThat's just a warm up\n‘Cause I can– on anybody, anybody", "image": "https://images.genius.com/deca44fb8344d17dc683a285c1ad8e1a.800x800x1.jpg"}], "artist": "Nas"}