{"songs": [{"title": "The Message", "album": "It Was Written", "year": "1997-02-03", "lyrics": "[Produced by Trackmasters]\n\n[Verse 1]\nFake thug, no love, you get the slug CB4 Gusto\nYour luck low, I didn't know 'til I was drunk though\nYou freak niggas played out, get fucked and ate out\nProstitute turned bitch, I got the gauge out\nNinety-six ways I made out, Montana way\nThe Good-F-E-L-L-A, verbal AK spray\nDipped attache, jump out the Range, empty out the ashtray\nA glass of 'ze, make a man Cassius Clay\nRed dot plots, murder schemes, thirty-two shotguns\nRegulate with my dunns\nSeventeen rocks gleam from one ring\nThey let me let y'all niggas know one thing\nThere's one life, one love, so there can only be one King\nThe highlights of livin', Vegas-style roll dice in linen\nAntera spinnin' on Millenniums\nTwenty G bets, I'm winnin' 'em; threats I'm sendin' 'em\nLex with TV sets the minimum\nIll sex adrenaline, party with villains\nA case of Demi-Sec to chase the Henny\nWet any clique, with the semi TEC—who want it?\nDiamonds, I flaunt it, chickenheads flock, I lace 'em\nFried broiled with basil, taste 'em\nCrack the legs way out of formation\nIt's horizontal how I have 'em fuckin' me in the Benz wagon\nCan it be Vanity from Last Dragon?\nGrab your gun, it's on though\nShit is grimy, real niggas buck in broad daylight\nWith the broke MAC that won't spray right\nDon't give a fuck who they hit as long as the drama's lit\nYo, overnight thugs bug ‘cause they ain't promised shit\nHungry-ass hooligans stay on that piranha shit\n\n[Refrain]\nI never sleep, ‘cause sleep is the cousin of death\nI ain't the type of brother made for you to start testin'\nI never sleep, ‘cause sleep is the cousin of death\nI ain't the type of brother made for you to start testin'\nI never sleep, ‘cause sleep is the cousin of death\nI ain't the type of brother made for you to start testin'\nI never sleep, ‘cause sleep is the cousin of death\nI ain't the type of brother made for you to start testin'\n\n[Verse 2]\nI peeped you frontin', I was in the Jeep sunk in the seat\nTinted with heat, beats bumpin'\nAcross the street you was wildin'\nTalkin' about how you ran the Island in '89\nLayin' up, playin' the yard with crazy shine\nI cocked the baby 9, that nigga grave be mine\nClanked him; what was he thinkin'\nOn my corner when it's pay-me time?\nDug 'em, you owe me, cousin\nSomethin' told me \"Plug him!\"\nSo dumb, felt my leg burn, then it got numb\nSpun around and shot one\nHeard shots and dropped, son, caught a hot one\nSomebody take this biscuit 'fore the cops come\nThen they came askin' me my name\nWhat the fuck? I got stitched up and went through\nLeft the hospital that same night, what\nGot my gat back, time to backtrack\nI had to drop, so how the fuck I get clapped?\nBlack was in the Jeep, watchin', all he seen speed by\nWas a brown Datsun\nAnd yo, nobody in my hood got one\nThat clown nigga's through, blazin' at his crew daily\nThe Bridge touched me up severely, hear me?\nSo when I rhyme it's sincerely yours\nBe lightin' L's, sippin' Coors on all floors in project halls\nContemplatin' war niggas I was cool with before\nWe used to score together, Uptown coppin' the raw\nBut a thug changes and love changes\nAnd best friends become strangers, word up\n\n[Hook]\nY'all know my steelo\nThere ain't an army that could strike back\nThere ain't an army that could strike back\nThere ain't an army that could strike back\nThere ain't an army that could strike back\n\n[Outro: Nas + (AZ)]\nThug niggas, yo, to them thug niggas\nGettin' it on in the world, you know?\nTo them niggas that's locked down\nDoin' they thing, survivin', yaknowmsayin'?\nTo my thorough niggas, New York and worldwide\nYo, to the Queensbridge Militia\n9-6 shit, The Firm clique\nIllmatic, nigga, It Was Written though\nIt's been a long time comin'\nY'all fake niggas, tryin' to copy\nBetter come with the real though, fake-ass niggas, yo\n(They throw us slugs, we throwin' them back, what)\nBring the shit, man! Live, man!\n(Fuck that son, word up) 9-6 shit", "image": "https://images.rapgenius.com/5830fba4cf57c00133f963e2538027a2.220x220x1.jpg"}], "artist": "Nas"}