[
{"artists": ["DJ Bone"], "album": ["A Piece of Beyond"], "text": ["The veteran DJ confirms his status as a treasured keeper of Detroit techno’s flame on an album balancing resolute functionality with a subtly psychedelic, expressive dimension.", "Eric Dulan has been doing his own thing for over 20 years now. Staying true to the essential principles of Detroit techno as passed down by his elders ", " and ", ", he has released record after record of steel-capped dancefloor movers, mostly on his own label, Subject Detroit. Doggedly independent and devotedly underground, he maintains a connection with the classic Motor City sound, balancing relentless forward momentum with a certain serenity and poise, and boasting the ability to turn simple ingredients into a heady, psychedelic soup by dint of sheer repetition.", "Despite, or perhaps because of, his classic stylings, Dulan has enjoyed a surge in popularity in recent years. He has slotted into a gap that’s appeared in the market as older Detroit DJs wind down their touring careers, steadily enlarging his fanbase through masterful, highly technical DJ sets. ", " is Dulan’s second full-length as ", ", after 2007’s ", ", a hard-to-find CD-R release. It’s also a swift follow-up to last year’s ", " LP, released under the name ", ". Through that alias, he dug into the anger and melancholy he felt after the death of his mother, transforming his darker emotions into more experimental material on several records for the London-based label Don’t Be Afraid. The experience of communicating through an alter ego seems to have expanded his vision; there’s an obvious grandiosity to this triple-vinyl release, even as he settles back into a more streamlined sound.", "The record starts boldly with “It Begins,” throwing a delicious squiggle of interplanetary bleeps over soaring, faux-choral pads—it’s a quirky track, recalling the muddy thrills of early UK rave, and it could only work as an opener. Likewise, the closing track is an outlier: a gospel house teardown featuring the vocal acrobatics of ", ", a Detroit producer and singer who died in 2010. Dulan reanimates one of Ragland’s unused vocals for an emotional final curtain, his close-harmonized falsetto reaching back to Detroit’s peerless R&B history.", "Aside from those obvious markers, ", " doesn’t waste a second on scene-setting or ambient diversions—this is end-to-end dancefloor material, and its hour and fifteen minutes pass in a breathless sprint. Most tracks draw their power from a careful balance of darkness and light: tough, expressive drums overlaid with increasingly psychedelic, time-shifting layers of melody and harmony. As a rule, all the working parts are visible, yet they fit together to create something mysterious. You could recreate it, but it would never be the same.", "The album’s highlights seem to prove this suspicion. On “Dreamers 9,” Dulan turns the simple thwack of the 808 into sturdy scaffolding for layers of drunken organs: sleek and functional, it occasionally strips down to just a solid kick, exposing the manufacturing process before rebuilding again. “Power Outage” offers livewire danger through the crackle of a broken connection, like a substation with its doors blown open in a storm. “Sweat” is sheer mechanics, as skull-cracking drums and woozy organs take us deep into the warehouse rave zone. But despite the engine-powered efficiency, the mood is far from inhuman: “Workings of the Inner Circle” brings squelching, soulful chords, while “All My Heart” is an ecstatic romance running on an 808 throb and oxytocin-laced synths as a voice whispers those three little words, over and over.", "The worship of Detroit techno can spill into fetishization too easily: This idea of a futuristic, sci-fi sound emerging from a post-industrial wasteland verges upon “", "” as we imagine the ghostly clang of machinery pealing through the broken windows of the Packard Plant. But despite its many imitators, it’s hard to argue with the feeling that Detroit techno just sounds best when it comes directly from that lineage. By dint of circumstance, raw talent, and endless persistence, DJ Bone has become a treasured keeper of the flame."]},
{"artists": ["Ashley Monroe"], "album": ["Sparrow"], "text": ["The Nashville singer-songwriter looks backwards to move forward on an album that filters contemporary desires and sorrows through the timeless vernacular of country.", "Orphans and sparrows fill the pages of the Great American Songbook, with standards like “His Eye Is on the Sparrow” and “Sometimes I Feel Like a Motherless Child” evoking the lowliness of humankind and the redemptive compassion of God. In opening her new album, ", ", with a song called “Orphan,” ", " aligns herself with that tradition. “How does the sparrow know more than I? When a mother is gone it learns how to fly,” she sings. “How does an orphan find its way home?” As she poses these questions to herself and to the listener, she is also engaging with the immense catalog of country, gospel, and folk that inspired her even before she moved to Nashville as a teenager.", "On “Orphan,” she achieves flight, a string section supplying the gust of wind that holds her aloft and pushes the chorus toward the sky. The song is anthemic but never overpowering, beautifully restrained and alive to the nuances of melody and phrasing. It’s one of the most moving moments in her small but solid oeuvre, with Monroe embracing country conventions not as elements to be mimicked or revived, but as means of communicating her own confusion, anguish, and desire. She looks backwards to move forward.", "Monroe recorded ", " after what she described to ", " as an “intense therapy-athon,” which allowed her to confront milestones as crushing as the death of her father and as joyous as the birth of her first child. The songs feel more personal than her previous work, but Monroe also understands that country music can balance such particulars with universals. Though tracks like the spryly melancholic “Mother’s Daughter” and the valedictory “Keys to the Kingdom” seem to derive from real situations, she pinpoints the emotions and sentiments we might all recognize and share. She sings not to confess but to connect.", "Monroe worked on the album with Dave Cobb, who has produced records for ", ", ", ", ", ", ", ", and just about everyone else who has been described in Nashville as a new outlaw. After the rambling roots music of 2013’s ", " and the countrypolitan sheen of 2015’s ", ", both produced with ", ", ", " whittles her sound down to guitars, bass, and drums, then glazes the songs with strings that flutter on “Rita,” swell on “Paying Attention,” and climb on “Hard on a Heart.” It’s not an unusual or unexpected sound, but the arrangements are so finely tuned and pair so perfectly with Monroe’s patient phrasing that they sound every bit as adventurous as the disco beats on ", "’ ", ".", "At its heart, ", " is an album about pining and yearning, two stock themes in country music. On “Orphan,” she searches for stability and direction; on “Mother’s Daughter,” she longs for something like home. Some of the most powerful songs are about carnal desires. Drawing on examples set by ", " and ", ", ", " and ", ", Monroe writes frankly about sex, especially on “Wild Love” (“Pull my hair and call my name”) and “This Heaven.” “I wish I  woulda laid my hands on you,” she sings on “Hands on You,” letting those first syllables hang in the air like a series of bedroom sighs. The “you” in the song doesn’t even matter. What’s important is the desire itself and her regret over not acting on it.", "The bluntness of Monroe’s lyrics lends depth to the self-portrait she sculpts in these songs, revealing just how much she longs for and cherishes human connection. When she sings about that haunted guitar she inherited from her heroes on closing track “Keys to the Kingdom,” she’s suggesting that music in general, and country music in particular, lets us voice our desires or at least accept that they’ll never be satisfied. It’s a fitting coda to the album’s emotional highpoint, “Daddy I Told You.” In a croon lightened by the peacefulness and confidence of an artist who’s spent her entire career building up to this moment, Monroe sings, “Daddy I told you I was gonna fly,” and the orphan becomes a sparrow, figuring out her wings on the way down."]},
{"artists": ["Sleep"], "album": ["The Sciences"], "text": ["Best new music", "The iconic stoner metal band’s first studio album in almost two decades is a twin ode to volume and weed. It makes everything that was originally great about Sleep even better.", "When ", " reconvened for ", " at All Tomorrow’s Parties in 2009, it looked as if they were simply rubber-stamping the Articles of Reunion. The icons of stoner metal played their great 1992 album ", " in full, along with a rare excerpt from the monolithic ", ", the record whose legal woes partially caused the band to splinter in 1995. Years later, the trio gave ", " the deluxe-reissue treatment, excavated archival songs that were never released, and issued a ", " through Adult Swim. All the while, Sleep nabbed pay-dirt slots on festival bills and toured big clubs, teasing the arrival of a new album—someday. Even when they posed ", " ", ", those promises felt like self-signing permission slips, allowing Sleep to continue making new money with old songs. That, after all, is the typical ’90s reunion ritual.", "But on ", "’ holiest of holidays, April 20, Sleep actually released their fourth full-length, ", ", through ", "’s ", ". And even more unexpectedly, it’s substantive enough to warrant its extended genesis and boost Sleep’s legacy, not just reaffirm it. The essential trick of ", "—and the reason it feels like more than an overdue cash-in—is these 40something dudes have managed to grow up without growing old. Their minds are still focused on weed and the escape that it offers, but that’s just the gag; these riffs, rhythms, and the mantra-like singing of Al Cisneros are a drug unto themselves, evidence of a band that’s improved upon their animating idea. It is a twin ode to volume and weed that makes everything that was originally great about Sleep even better.", "In their own bands, Cisneros and guitarist Matt Pike have progressed to more adult concerns. ", "’s ", " was ", " ", ", its conspiracy theories and apocalyptic scenarios laced with twin senses of fantasy and fable. And since the start, Cisneros and his band ", " ", " ", ", navigating a tangle of religious iconography and mystical koans. During the last decade, though, they have allowed themselves to slip fully back into Sleep, like old college buddies escaping to a cabin for a weekend retreat of booze, joints, and limited responsibilities. These songs are funny, loaded with the sort of pot portmanteaus (“rifftuals” goes into the lexicon immediately) and puns (as does “The CBDeacon,” their amazing nickname for ", " bassist ", ") you’d expect from a band that once recast weed smoke as the Star of Bethlehem. They celebrate the “", "” and talk about space travel through the “", ".” There’s a song that turns the universe of ", " into a land of bud and bongs, another that urges melting icebergs to fight back against the cities that are killing them. (Feeling stoned yet?)", "But Sleep have never played so audaciously or so well as they do here. Cisneros has always been an interesting singer, but he’s never sounded so powerful or resolved as he does on ", ". During “Sonic Titan,” he is practically messianic, his see-sawing monotone dispatching you to Zion; for “", ",” he pushes and pulls the melody horizontally and vertically, bending it in time and in harmony. He’s no longer only intoning directions toward Nazareth, he’s leading you there. Pike practically wrestles his guitar during the solo for “Antarcticans Thawed,” which slips so far out of time and tune that it feels like free jazz. Elsewhere, his riffs are lean and elegant, curved like the chrome fenders of a classic motorcycle.", "And since joining the band after those initial ATP comebacks, drummer Jason Roeder has become an essential influence. He splits the difference between ", "’s John Bonham and the jazz-rock legend Billy Cobham, a seismic shift for Sleep’s past atavism. On “Antarcticans Thawed,” he plays with a sense of narrative, steadily arcing from a restrained military march to a lumbering groove to, at the song’s peak, fills that amplify the melody itself. This subtlety is a testament to his time in ", ", doom’s most sophisticated and nuanced storytellers. This is a revelatory new philosophy for Sleep.", "Reunions don’t often go like this. ", " and ", ", ", " and ", ": At their best, those restarts allowed young fans to witness a band they assumed they’d always missed. At their worst, they turned into embarrassing reminders that our heroes can be greedy misanthropes. But Sleep’s return on ", " recalls the joyful revival of ", "., another trio who applied new skills to old attitudes on 2007’s ", ". That record, of course, launched a stunning second phase for Dinosaur Jr., arguably better than their first. Sleep may move too slowly for that to happen, but for now, these six new rifftuals burn perfectly."]},
{"artists": ["Smoke DZA"], "album": ["Not for Sale"], "text": ["Harlem rapper Smoke DZA keeps it real on ", ", doubling down on classic hip-hop as he’s got an allergy to trends. That’s mostly a good thing.", "Harlem rapper ", "’s ", " is a memorandum for culture vultures, those outsiders who, in his mind, are trying to pollute rap, and those industry insiders trying to sap its swagger for their own personal gain. DZA is a classicist, and he derides those in the game selling out, all while listing off the things money can’t buy them—the love, smoothness, the culture, the cool. If 2016’s ", " with Bronx legend and rap super-producer ", " was DZA’s taking a stand in deed, aligning himself with a cultural icon, then this is him writing new bylaws. These are DZA’s 12 rap commandments, in which he extols the mid-grade hustler.", "DZA’s rap philosophy is to always err on the side of caution. This can make him a bit of a conservative music-maker, but it also makes him relatively dependable. He presents a lifestyle of subtle comfort and his verses are capo proverbs rapped through kush clouds. He presents himself as rap’s ", ", saying things like, “Heavy is the head that wears the crown; imagine how my wrist feel.” He isn’t ", " interesting, and his writing can underservice his workmanlike flow, but his raps are always appealingly aspirational. He’s the hood everyman turned ", ". “Smoking on Cheeba, sipping on Chevas/I’m in the old school, center of Portland like Arvydas/Them niggas tryna style, I’m like beat it/It’s Bob Marley on my chain, not Jesus,” he raps on “The High.” He has largely remained consistent, if not stagnant, since 2010’s ", ", occupying the same realm of scotches, cigars, indica blends, and Raf Simons Adidas.", " stays true to DZA’s formula but opens the aperture just a bit wider. He doesn’t have the most distinct perspective, so he compensates by building his persona. On “The Love,” his better half is presented as a reflection of himself; her taste enhancing his, which is, in a clever way, another proposed demonstration of his discerning nature. “Connoisseur, mature, Dior type of fly/Comador cigars, Macallan with no ice/No gettin’ sauce, endorse a ratchet TV night/Laugh, experience life, we too young to be angry and hype/We ain’t perfect but our future is bright/And even imperfection is perfection in sight,” he raps.", "Despite his confidence, DZA isn’t exactly introducing novel sounds or ideas on ", ", but that doesn’t mean it can’t still be fun to hear him navigate New York City with fresh eyes. Half the charm of this record is simply how comfortable DZA seems, even as he fights off rap profiteers and extortionists. He’s never been (and won’t ever be) a rapper par excellence, and that’s kind of the point: He’s settled into his own underdog niche. DZA positions himself as a dark horse, the unassuming alternative to outright primacy, and his nonchalance makes it that much more endearing.", "DZA’s constant commitment to cool is upholstered by his ear for luxurious beats. “The High” samples ", " “Didn’t Cha Know,” in a flip that sounds eerily like ", "’s “", ",” but the bass is far more warped, and his flows tumble directly into the knock of the drum as a disembodied Badu wails from within. “The Mood” invokes ", "’s “Guess Who’s Back,” repurposing the same intro from the Originals’ shimmering “Sunrise,” as DZA and ", " take turns repping their boroughs. From the decompressed doo-wop of “The Legacy” to the Boi-1da-lite of “The Game” and “The Antidote,” scanning boom bap and trap drums, Smoke DZA always manages to find his sweet spot.", "In a rap age of larger-than-life excess, where even the most basic rappers are ", ", an image that lends itself to surreality, Smoke DZA’s boasts are accessible, manageable even. He doesn’t want things to look too easy because they weren’t—he likes to show his work—or too exaggerated because it can cheapen that labor. There aren’t any Teslas racing through these raps; he’s got an unlimited line of credit at… Ikea. In this vein, “The Hustle” is a DZA manifesto of sorts, where he reaffirms his dedication to the cash grab that is capitalism and chastises those unwilling to work for theirs. Money is his primary motivator, but he’s nearly as driven to defend rap from those who would misuse it."]},
{"artists": ["Steven Julien"], "album": ["Bloodline"], "text": ["The London producer pays tribute to his musical and familial heritage on a sophomore album that makes vintage Roland gear sound new again.", " is a record whose roots run deep. ", "’s follow up to his 2016 debut album, ", ", is named for the influence the London producer’s family has had on his music. But ", " resonates even more profoundly as a callback to Julien’s musical heritage, with each track featuring a piece of Roland equipment—most notably the iconic TR-808 drum machine—in honor of Roland founder Ikutaro Kakehashi, who died in April 2017.", "Julien may be the ideal musician to pay tribute to Kakehashi. Julien’s productions, while inventive in execution, are relatively simple in sound, using a basic palette that would have been familiar to the Detroit techno innovators of the 1980s who did so much to enhance the reputation of Roland’s TR-808, TR-909, and TB-303 machines. ", " takes this minimal approach even further than the nearly skeletal ", ": The new album’s title track is built on 808 drums and a daub of spectral melody from a Roland Juno synth, while opener “Hunt” uses little more than shifting synth drones, the ominous clanging of a bell, and a noise that resembles the nervous rustle of a thousand wind chimes in a desecrated church.", "What makes an impression here are not so much the individual sounds—there are few of those jaw-dropping set pieces that you get in the work of ", " or ", "—but what Julien does with them. This is where the bloodline of the title comes in: Julien ", " that his drum programming “ain’t coming from just me, it comes from a long line of ancestors” that includes “rhythm from tribes in Africa and natives from the Caribbean.”", "It would take a musicologist to comprehensively trace this evolution, but there is something unique about the way Julien programs a drum machine. On “Roll of the Dice,” his 808 sounds like it’s on the verge of a funk-strained nervous breakdown, its rhythms punctuated by brutal bass drum rolls that seem to want to punch their way out of the 808’s casing. The beat breathes new life into the acidic squiggles of the TB-303, one of the most overworked instruments in techno, constructing a ramshackle acid house that patrons might fear to enter. “Queen of Ungilsan” pushes the electro snap of the 808 in weirdly syncopated directions, with drum hits darting into the mix with the precision of a production-line robot playing jazz.", "The liberated feel of Julien’s drum programming extends to the way the songs are arranged. While much electronic music is tightly constrained, programmed in blocks for maximum dancefloor response, sounds on ", " come and go freely, with a drum roll or a cymbal crash introduced because it feels right, rather than simply to mark the passing of 16 bars. Tempering these hard machine rhythms is a liberal sprinkling of melody that brings to mind the work of Detroit techno pioneer ", ". As May did on late-’80s tracks like ", " Julien scatters impassioned, jazzy touches on “IDK” and “Queen of Ungilsan” to offset his percussive thrust.", "This is an album equally suited for swooning or raving, six tracks with enough thump for the dancefloor and enough brain food for the couch. Julien ", " that ", " “feels more in your face sonically” than ", ", and there is a certain raucousness to the drum sound on “Roll of the Dice” that wasn’t obvious on his debut. But the new record is more a companion piece to ", " than a giant leap forward, a reminder that musical bloodlines runs deep and that simple machines can sing with soul. Ikutaro Kakehashi, who built his machines to favor ease of expression over virtuosity, would have approved."]},
{"artists": ["Del the Funky Homosapien", "Amp Live "], "album": ["Gate 13"], "text": ["Protean future-funk production steals the show on this collaboration between two veterans of the Bay Area hip-hop scene.", "When a rapper and a producer collaborate on an album, it’s usually the beat maker who is working in service of the MC, humbly delivering a metronomic base tailored to the rhymes. This isn’t the case for ", ", which teams up two Bay Area fixtures, rapper ", " and producer Amp Live (formerly of the crew Zion I), and adjusts the formula so that Amp Live’s funk-forward beats dominate the listening experience.", "Del’s cartoonish brogue remains one of the warmest, most likable voices in hip-hop. Throughout the album, he raps more economically than he has in the past, and this concise style allows his imagery to shine. Over the powerful snares of “Run Free,” he recounts a caper that finds the narrator chasing his foes onto a fire escape. “They tried to climb down to the fourth floor,” he raps at the story’s climax. “My posse shoot ’em down, now they skydiving.” On “Wheel of Fortune,” he takes out inferior MCs like he's playing a video game: “I know some kung fu/Tiger style, crane style, they gonna get pummeled/Down, down, left, left, punch/That shit’s fire all around.”", "But it’s Amp Live’s production that makes ", " distinctive. The short opener, “Attention (Intro),” is like an overture: Deep, squelching bass tones, melodic keys, and spacey ambient effects set a future-funk mood for the album. Clipped snares and sci-fi synths follow on “Wheel of Fortune”—but after a minute of bubbling into a groove, the song slows to a reggae tempo for a short instrumental passage before seamlessly transitioning back to its original sound. Del’s voice is present, but it’s the instrumental soundscape that dictates the shifts in mood.", "The album is full of inspired hip-hop production like this, with beats that transform throughout individual tracks, rather than just locking into a trusty boom-bap rhythm. “Run Free” showcases bass tones and drum patterns that recall, at various moments, ", " ", " and ", " without plagiarizing them. Amp Live subtly adds and removes hi-hats throughout the melancholic “The Glow,” building and then slowing the track’s momentum. The introduction of a squiggly synth riff heightens the drama of Del and guest rapper Eligh’s most braggadocious lines in “On the Ball,” in which Del warns sucker MCs, “It’s easy to catch a rat/Just put some cheese on the trap/Shipwrecked, they wanna raft/’Bout to take a piranha bath.”", "It seems appropriate that Amp Live gets the final word on ", ", with “Lateral Thinking,” an instrumental track that begins with monstrous, noisy wobble bass tones straight out of a free-jazz jam, then lets celestial synths smooth the way to mellow guitar lines and a rolling 808 beat. When the album closes by fading to static, it’s as if the beat maker is pulling the plug on his own dynamic creation. Del may be the MC in this duo, but Amp Live’s production speaks just as loudly as the rhymes."]},
{"artists": ["Nines"], "album": ["Crop Circle"], "text": ["The latest album from the star of UK road rap is an entirely new and impressively unconfined sound with Nines still grounding himself firmly in his past.", "As groups gathered in parks or on balconies across London on April 20th—otherwise known as international weed day—to enjoy one of the hottest spring days on record, chances are, for rap fans, the soundtrack to their Friday evening came in the form of Nines’ sophomore studio album, ", ". The theme of its accompanying short-film comically pivots around the hyperlocal weed economy of Nines’ housing estate, suggesting the timing was no coincidence. People took to Twitter to brand the release superior to ", ", reflecting the London’s newfound ability to harvest and enjoy its own product over North-American competitors. “Nina wid da Nina” has used his year of mysterious silence to eclectically develop the icy neck-chains, boastful similes, and smooth Ma$e-like flows which have always formed the core of his aesthetic.", "Born Courtney Freckleton to a Jamaican father and Somalian mother, Nines grew up on Church Road Estate in Harlesden, an infamous part of North West London known for its violent crime and concrete housing blocks. Since 2012, as the frontman of the Ice City Boyz collective, he has put out four classic mixtapes and a multitude of street anthems. The release of his highly-successful first studio album ", ", after signing to XL, allowed him to become one of the only commercially viable kings of road rap. This loosely defined genre, shouldered through the late-2000s and early-2010s by the likes of ", "’s favorite ", ", as well as ", " and ", " (two local rivals of Nines), and perfected most recently by young-gun ", ", relies upon the hardline, weathered authenticity of its artists. Being an ", "—one who needs to prove little but, regardless of recognition from the masses, does everything in their power to retain their reputation on the roads—is a prerequisite. This is in stark contrast to the energetic temperament of London’s more performative MC-led movements, like grime or the teething ", " phenomenon.", "The ", " also called ", ", which Nines wrote, directed, and stars in, was released out of nowhere three days prior to the album. It is an impressive venture, proving that he has spent a year in the wilderness developing his multi-channel personal brand. Interwoven with trimmed threads of music, it serves as a collection of light-hearted vignettes about life on Church Road Estate. And while it won’t win a BAFTA, the comic scenes allow Nines to make himself more accessible, more vulnerable. This striving to connect with the fans is characteristic: After being sent to prison in 2013 for drug offenses, he posted his prison number online and encouraged people to write to him.", "The album’s lead single “", "” was previewed to the world earlier this month. Its fun-filled video starts with Nines waking up to a bowl of chunky weed buds in a West Hampstead mansion, and features wild scenes of him levitating cross-legged, cooking up drugs in a snow-filled kitchen, and playing penny against the wall with the mandem. The song’s contagious, celebratory bounce makes it impossible not to dive headfirst into the remaining 15 tracks—although it is a shame that its playful tone is not replicated elsewhere on the album.", "Throughout most of ", ", Nines leaves the care-free party behind. Instead, he switches between contemplation and showboating, confessing to his life as a successful musician who still craves the financial rewards of industrial-scale drug-dealing: “I just made six-figures off of streams/Still dealing with the fiends ‘cause I got bigger dreams,” he admits in opening track “Picture in a Frame.” Many songs starts with the booming words of “Zino Records,” a touch that has always acted as both a symbolic wax seal for Nines’ music and a reminder that despite his glimmering braggadocio, the loss of Zino, his older brother who was gunned down in an alleged gang beef a decade ago, keeps him grounded and wary of his past.", "Nines has traditionally been at his best while demonstrating an ear for the most precise, ethereal beats. This skill is perfectly applied in “Liz”—slang for money, his favorite topic, referencing the image of Queen Elizabeth II on British currency—whose delicate piano keys paint the picture of a reflective late-night car ride through the city. But the most impressive thing about this album is the way Nines has dared to take listeners into unchartered territory through a mature selection of soulful, melancholic as well as dancefloor-friendly tones, all made possible by the delivery of appropriately chosen features. Singer Ray BLK outshines everyone on “Rubber Bands,” which includes a verse from fellow Ice City Boy ", ". On “Oh My” the cheeky, contagious chorus from ", " alongside teenage south London driller ", ", adds punchy schoolboy wit to Nines’ authoritative mumble raps.", "It is refreshing to be able to sit down and sample such a patiently curated venture from a character as openly likable yet still intriguingly reserved as Nines. ", " perhaps lacks some of the standout street anthems that have, in the past, propelled him into hood stardom. But the result is something entirely new, an impressively unconfined body of work. It doubles as a snapshot of London’s cross-pollinating music scene and a signal towards the rapper’s maturation as he continues to transition from being a homegrown talent into an increasingly reputable MC on the world-stage."]},
{"artists": ["Mr. Fingers"], "album": ["Cerebral Hemispheres"], "text": ["On the first full-length Mr. Fingers album in almost 25 years, Larry Heard attempts to sum up the full range of his interests and talents.", "Despite the visceral punch of the Chicago house innovator ", "’s earliest hits—“", ",” from 1986, churned with grueling acid squelch; the following year’s cymbal-battering “Slam Dance” came down like a hailstorm—it’s his conflicting impulses that made him an icon. His two biggest tunes, “", "” and “", ",” both released under his Mr. Fingers alias, balanced percussive force with a newfound softness, drawing up the blueprint for deep house in the process.", "But that same reluctance to settle into a single lane probably kept him sidelined in a genre that can be notoriously risk-averse. Boasting a glistening finish and bearing titles like “Dolphin Dream,” 1994’s freeform ", " came closer to new age, while 1995’s ", " suffused hip-hop and house beats in crystals and incense. The following year, ", " grafted jazzy R&B onto cosmic synths, suggesting a lab-grown hybrid hatched way out in interstellar space.", "Heard has periodically returned to remind clubbers that he is a force to be reckoned with; his 2006 single “The Sun Can’t Compare” has attained latter-day classic status. Now, with ", ", the first Mr. Fingers album in almost 25 years, he attempts to sum up the full range of his interests and talents.", "His last Mr. Fingers release, 2016’s ", " EP, picked up ", "’s interstellar signals and translated them back into the language of the dancefloor, and part of the new album continues that project. In fact, all four of the EP’s tracks are reprised here, scattered across the album: The gurgling standout “Outer Acid” finds its mate in the steely minimal techno of “Inner Acid”; the ruminative drum circle “Nodyahed” has a new percussive counterpart in the title track, a similarly hypnotic array of drums, synths, and breathy accents.", "But the operating metaphor this time is not space but the brain, whose opposing halves preside over ", "’ dual nature. Counterbalancing his techno leanings, a good portion of the album is given over to R&B’s silkiest trappings: jazz brushes, saxophone solos, dimmer-switch synths. In a recent ", " interview, Heard recalled a proposed ", " collaboration that never came to pass, and there are hints of what that might have sounded like in the quiet-storm detailing that shades the album’s first half. A slow-burning blues guitar solo colors “City Streets,” a mid-tempo house instrumental; “A Day in Portugal” drizzles honeyed pads over a bossa-nova beat; the horn leading “Sands of Aruba” wouldn’t have sounded at all out of place on ", ".", "Given that the last Mr. Fingers full-length, ", ", came out in the second year of Bill Clinton’s presidency, it’s understandable if Heard wants to make up for lost time, but the album probably doesn’t need to be 100 minutes long. Its length might have worked better if he had more neatly divided its 18 tracks into a right-brain and left-brain side, rather than breaking up its flow by zigzagging between satin-finish soul and misted minimal house. But the few surprises scattered along the way that make its unpredictable course feel worthwhile.", "In “Tiger Lounge,” jazz guitar, sitar, and dub swirl together over indistinct background noise; whether a live recording or a simulacrum of one, it suggests a space that’s not quite of this world. Then, just past the album’s midpoint, “Electron” fires up the fattest-sounding synth in Heard’s arsenal and sets its course for the heart of the Arpeggio Nebula, following in the path of cosmonauts like Klaus Schulze and ", ". Set to a skeletal beat, it’s the simplest song on the album, and the perfect distillation of his expressive sensibilities."]},
{"artists": ["Captain Beefheart and His Magic Band"], "album": ["Trout Mask Replica"], "text": ["Best new reissue", "Captain Beefheart’s 1969 masterpiece set an unmatched standard for avant-rock. This new reissue from Third Man puts it back in print on vinyl.", "Though it’s hard to tell by listening, the first two albums by ", " (aka Don Van Vliet) found him creatively frustrated. ", " from 1967 and ", " from the following year were inventive blues-rock records, but Beefheart had bigger ambitions. At that point, his group the Magic Band were a mostly democratic collective, and since Beefheart had less musical expertise than his colleagues, his odder suggestions were vetoed as too unconventional. “That really pissed him off,” said bassist Gary Marker. “[Because] he had all these ideas in his head and he had no way of getting them across to people.”", "To gain the control he needed to express his vision, Beefheart morphed the Magic Band into a kind of musical cult. In mid-1968, he replaced some members of the group with younger, more impressionable players (guitarist Bill Harkleroad and bassist Mark Boston were each just 19), gave everyone a nickname to match his own, and holed up with them in a house on the outskirts of Los Angeles. The sessions in the house have since become a crucial part of rock legend, the subject of contradictory stories and much myth-making. By many accounts, Beefheart imposed weird lifestyle rules and played mind games that bordered on brainwashing. Some claim the musicians couldn’t leave the premises save for a weekly grocery trip, and drummer John “Drumbo” French said he spent one month eating only a cup of soybeans every day.", "Beefheart put a piano in the house—despite not knowing how to play it—and banged out ideas, which French transcribed and assembled into tunes. The resulting pieces were more like puzzles than songs, giving different instruments conflicting time signatures and varying part lengths that had to somehow meet at specific points. French compared it to building a solid wall with bricks of unequal size. This unorthodox complexity forced the Magic Band to rehearse 12 hours or more a day, usually without Beefheart. Often they would sleep right where they had just practiced, and immediately continue upon waking.", "After six months of this bunkered mania, the Magic Band entered a studio with Beefheart’s friend ", ", who “produced” them by staying out of the way. Riding the adrenaline of their intense woodshedding, the group recorded 20 songs in less than six hours. Beefheart added vocals separately, syncing uncannily with the music despite rarely having rehearsed with the band and eschewing headphones during takes. In less than a week, after adding two tracks from an earlier session and a few more made at the group’s house, ", " was born. As Third Man’s new reissue makes clear, this 28-song double album might be the strangest record in major-label rock history. Beefheart made more accessible music before and after, but his most difficult work is still his most famous, defining his musical legacy and the sound of the Magic Band for going on five decades.", "Its enduring place in the canon is due in part to the allure of ", "’s singular logic. Like life in a cult, the music seems crazy to an outside observer but makes perfect sense once you’re inside. In a ", ", “The Simpsons” creator Matt Groening said it took him just seven listens to go from hating the album to deciding it was the greatest of all time. Few records lend themselves to such a transformation, where they eventually click into place while still sounding so thrillingly wrong. The rules that ", " shattered haven’t been reassembled in quite this way by anyone since. After all, capturing its sound would mean somehow retracing the steps from Beefheart’s enigmatic brain to French’s devout hands to the Magic Band’s inhuman toil.", "The thrill of ", " also lies in the boggling assemblage of stylistic and thematic strands. There are shards of rock and blues in the band’s deconstructed grooves; free jazz in Beefheart’s primitive, ", "-inspired saxophone playing; literary surrealism in his obscure yet oddly resonant lyrics; outsider folk in his growled a capella songs; and postmodern collage in the album’s diverse sound sources, which include field recordings, spoken skits, studio banter, and even vocals recorded over the phone. Though the songs seem to reject convention, there are references to musical history scattered throughout ", ", from snippets of melody borrowed from traditional tunes to lyrical quotes like Beefheart’s chant of “Come out to show them” in “Moonlight in Vermont,” taken from ", "’s ", " from two years earlier. Though Beefheart’s lyrics were mostly oblique conundrums, he could also be bluntly topical, singing boldly about the Holocaust and the Vietnam War.", "And though Beefheart could be pathologically controlling with his bandmates, he was surprisingly open to chance and accident throughout ", ". He left in the sounds of the tape player pausing in his acapella songs, inserted recordings of himself wandering the weeds into others, included mistakes and under-breath commentary in pre-song skits, and created one spontaneous track, “The Blimp,” by having guitarist Jeff “Antennae Jimmy Semens” Cotton call Zappa and read him a poem, which Zappa recorded while his own band, the Mothers of Invention, played in the background.", "Perhaps most surprising is how catchy ", "’s jagged songs turn out to be. Some even have verses and choruses, albeit filtered through the band’s sonic contradictions and Beefheart’s skewed timing. The rushing climaxes of “Ella Guru,” the building swing of “Pachuco Cadaver,” and the swaying blues of “She’s Too Much for My Mirror” are all earworm inducers, as their multiple sonic elements coagulate into melody, like filaments spastically aligned by a magnet.", "Over five decades, ", " has proven incredibly durable, still sounding as bracing and radical as any rock music since. That’s even clearer in this remaster, sourced not from the decayed original masters but from less-worn backups. But was the music worth what Beefheart put the Magic Band through? French and Harkleroad have both said that though they wouldn’t want to endure it all again, they were thrilled to have created such a landmark. They certainly deserve more credit than they got from Beefheart, who often claimed to be the sole songwriter (he even left French off the original album credits completely, apparently as punishment for leaving the band before it was released). But luckily each member’s vital contribution is loud and clear in every note, beat, and weird and wonderful turn. Captain Beefheart might have led this cult, but ", " is the work of a collective—a serendipitous line of charged neurons that wired together to make something truly magical."]},
{"artists": ["Sarah Davachi"], "album": ["Let Night Come on Bells End the Day"], "text": ["Using Mellotron and electric organ, the Canadian minimalist teases echoes of Baroque music and post-rock while honing in on the idea of the drone as a phenomenological, time-bending experience.", "Few artists would want to be defined by their earliest attempts at original work, but in the case of Canadian minimalist ", ", her sandbox phase is instructive. As a fan of the Romantic tone poet and pianist Frédéric Chopin, the young Davachi took his tear-jerking chord progressions and distilled them into her first compositions, with everything subordinated to these shifting tonal elements. Her motivations haven’t changed much since those early experiments in tone and texture, even if her methods have. Like Henri Matisse, whose paintings turn still life into inner life by prioritizing color above all other elements, Davachi drills down into a single instrument at a time, cracking open a vast spectrum of harmonic variation to reveal new expressive possibilities.", "On ", ", her fifth full-length release in six years, Davachi limits her palette to Mellotron and electric organ across five pieces which, like the best drone music, offer a fleeting glimpse of the infinite. Her albums derive their individual character from their respective sets of instruments, varying according to her systematic exploration of the range of available timbres. ", " in 2016 was composed on the EMS Synthi 100, an analog synthesizer from the 1970s, while last year’s ", " was entirely acoustic, focusing on overdubbed strings, organ, piano, and voice. Davachi’s ability to leap from instrument to instrument, framing their individual temperaments while listening for unexpected affinities, isn’t a fluke; one of her first jobs was as a guide at Calgary’s National Music Centre, where she would arrive early to spend time learning a new instrument before conducting tours.", "Throughout her many releases since 2013, Davachi, who studied electronic music at Mills College, in California, has tended to center herself in meditative, durational drones, drawing comparisons to the deep, dense planes of ", " and ", ". But once you’re absorbed into the hazy vistas of ", ", ornate melodic whispers begin to peek through. On “Mordents,” she hints at a childhood spent straight-backed at the piano as a baroque melody wends its way towards encroaching chords, each note decaying into harmonic fog; tones mingle like drops of moisture in the air until all is enveloped.", "Grander still, “Buhrstone” unfurls itself like a post-rock epic, each chord change building up to an urgent, breath-catching ecstasy; after seven minutes, the climax echoes the soaring heights of ", " or ", ". Through the familiar wobble of the organ and the Mellotron—a 1960s keyboard that utilizes magnetic tape—Davachi also paints a subtle homage to classic rock bands like ", ", ", ", and the ", ". The trail of organ reverb in the final seconds of “Mordents” even feels like an abstract approximation of a rock ‘n’ roll ending: a flourish at the end of a black angel’s death song.", "The fifth and final piece, “Hours in the Evening,” is a sensory nerve-jamming of sustained, pearlescent tones that nods to her chief influence, the minimalist pioneer ", ", whose practice had a transformative effect on Davachi as a music student. Like her forebears, Davachi has an innate understanding of drone music as a phenomenological, time-bending experience. The beauty of drone, after all, lies not in its duration but in its ephemerality: a single, conscious moment both collapsed and extended, disintegrating right before us. ", " is loyal to that momentary perception of the sublime."]},
{"artists": ["GUM"], "album": ["The Underdog"], "text": ["The latest from Tame Impala and Pond’s Jay Watson smooths out the pastiche psych-rock and dials down the eccentricity to create a more seamless song cycle.", "Jay Watson isn’t shy about self-deprecation. His recent string of albums as GUM have functioned as billboards for his own diffidence: ", ", ", ", and now, ", ". Perhaps such humility is a natural byproduct when you’re a silent partner in both ", " and its ", ", while trying to carve out space as a solo artist beyond their long shadows. By Watson’s ", ", GUM’s past records effectively served as storing houses for whatever ideas are bouncing around his head when he’s not playing with his other bands. But the encouraging evolution of the project suggests that Watson may not be able to keep up the false-modesty act for much longer.", " is built from the same toolkit as GUM’s previous releases—psychedelia, prog, ‘70s soft rock, disco, electro—but smooths out their pastiche quality and dials down the eccentricity to create a more seamless song cycle. According to Watson, ", " is a quasi-concept album that presents a dusk-to-dawn snapshot of his life. The passage of time isn’t so much marked by specific events as impressionistic shifts in mood, where the promise of the night gives way to intense wee-hours introspection.", "As per GUM tradition, the album opens with a brief instrumental teaser—in this case, a sun-beamed synth aria—however, the fact Watson actually titled this one “Introduction” reinforces the greater attention to structure and sequencing in effect here. It leads us right into the album’s title track/theme song, a shot of swaggering cosmic funk where Watson throws down his mission statement: “Always go for the underdog!” His declaration is instantly undercut by a rejoinder that’s perfectly Lennon-esque in both sound and cynical spirit: “Someone’s always in the way/And that’s not gonna change.”", "It’s tempting to read that exchange as a comment on Watson’s relatively humble standing next to Tame Impala frontman Kevin Parker and the challenges of establishing GUM’s own identity. At times, it’s impossible to ignore the, ahem, under-", " flowing through ", ": the lo-fi ballad “After All (From the Sun)” blossoms into a bass-synth bounce that will have you mentally transposing the woozy chorus refrain to “’Cause I’m a Man,” while the soft-focus intro of “The Blue Marble” is upended by a booming break that could pass for a pitch-shifted remix of “New Person, Same Old Mistakes.” But the big difference this time is that GUM no longer sounds like the idiosyncratic, lo-tech offshoot of Tame Impala: In both its more luxuriant production and more emotionally resonant songwriting, ", " finds Watson pursuing his own widescreen vision of lonerism.", "Following a playful opening stretch, ", " reveals its wounded core during its more absorbing second act, where Watson slips into an insomniac’s fever dream wracked with anxiety and self-doubt. “Rehearsed in a Dream” is a dark-night-of-the-soul reckoning embedded in a hazy fog of Floydian psych and quiet-storm R&B, and that encroaching sense of existential dread peaks on the gripping “Trying My Best,” a self-help mantra amplified by the sort of dramatic, throbbing synths you hear on a ’70s European sci-fi-flick soundtrack. But with the neon-tinted disco of “The Fear,” Watson opts for the most effective therapy: losing your mind at the club. “I’ve got the fear!” he repeats, and the directive is clear: sing along if you know the words—or, better yet, tremble uncontrollably if you’re all too familiar with the feeling."]},
{"artists": ["Ross From Friends"], "album": ["Aphelion EP"], "text": ["In the big leagues now, one of the architects of lo-fi house tries to class up his goofy name with a four-track EP and a high-def vision.", "Dance music loves a tempest in a teapot, and few have whistled louder over the last few years than the dust-up over ", ". The term popped up around 2015 to describe a wave of producers like DJ Boring, ", ", and ", ", who lacquered moody vocal house in tape hiss and racked up millions of plays practically overnight. Their memetic nostalgia attracted the kind of extremely online fans who were probably commenting “a e s t h e t i c” on ", " six months prior, and rankled the ", ", who picked up a whiff of ironic detachment.", "A little fun never hurt anyone, but purists had a point when they argued that this scene seemed more like an exercise in re-branding familiar house tropes for Gen Z audiences than a truly fresh sound. In fact, lo-fi offered a fascinating ", " of how songs that fuse several common genre elements—say, house beats and nostalgic R&B samples—receive an advantage from the machine learning algorithms that drive music discovery on streaming platforms. That’s why Ross from Friends’ “Talk To Me You’ll Understand” pops up so often in your recommended tab on YouTube.", "Despite their initial struggle to be taken seriously, the lo-fi producers’ schtick masked real ambition. “I think my name is very far down on my list of ‘things that are important about my music,’” Ross wrote during one ", " (read: Twitter spat with a blogger) in the lo-fi wars. In fact, his real name is Felix Weatherall, and he’s from Colchester, UK, but he’s right that this is beside the point. Arguments about whether he and his peers “really mean it” have faded over the last 18 months, as they’ve released a stream of solid tracks on crucial labels and emerged as genuine stars on the club circuit. Weatherall, for his part, recently signed to Brainfeeder and ", " at Berghain’s hallowed Panorama Bar.", "He’s in the big leagues now, and the four-track ", " EP feels like an attempt to class up his goofy moniker with la-di-da cover art and a Greek non sequitur. (An aphelion is “the point in the orbit of a planet, asteroid, or comet at which it is furthest from the sun,” FYI.) The effect is of a self-conscious bro trying on his dad’s itchy tweed blazer before an intimidating date. That’s fine—artists deserve the chance to reposition their brand upmarket, as long as they have the tunes to back it up.", "Weatherall’s older material used sepia-toned tape hiss to gesture at nostalgia. Yet the simplistic compositions never seemed to pin down what exactly he was nostalgic ", ", beyond a blurry idea of “the ’90s, man.” On ", ", he wipes the fog off his lens and a widescreen vision blossoms into focus. Keys drip with detail. Synths shimmer. Kicks and snares land with a 4K ", ".", "Lead single “John Cage” is a holdover from an old hip-hop project that Weatherall started with a friend named Guy. The song’s moving parts unfold with a patient logic. A sample from a daffy guided meditation exercise introduces billowing new age textures. Pitch-shifted vocals, via Guy, warble a jazzy lullaby. Seagulls squawk in the background. Synth streaks accent the mix with oversaturated hues familiar to anyone who’s ever spent a psychedelic afternoon at the beach, staring at the sky.", "The most forgettable track is the one most indebted to lo-fi tropes. “There’s a Hole In My Heart” has a sweet, yearning vocal, but its 4/4 shuffle never really goes anywhere, and Weatherall falls back on drowsy chords you’ll recognize from a zillion Soundcloud mixes. I prefer the limpid electro bauble “March,” which is basically a DJ Stingray tune in relaxed-fit sweatpants. Some may be partial to electro with more gas in the tank, but in Weatherall’s hands a little syncopation goes a long way.", "Best of all is “Don’t Wake Dad.” The beat flirts with R&B; in fact, it sounds like a friendly ghost that’s crawled into the warm hollow of a memory-foam mattress only recently vacated by ", "’s 2010 masterpiece “", ".” I couldn’t stop humming “touch it girl, touch it girl, touch it girl, ahhh” when the break comes in.", "Then, just when you think you’ve got it figured out, Weatherall unleashes a blast of beatific sax. It’s schmaltzy and totally disarming, like something you’d hear at a rave thrown by the ", " stick figures. Here we have the clearest picture yet of what a Ross From Friends track should sound like: hands in the air, tongue in cheek, heart pulsing on its sleeve."]},
{"artists": ["Daniel Avery"], "album": ["Song for Alpha"], "text": ["Turning away from the mix of big-room energy and outré sounds that marked his debut, the London producer’s surprisingly muted second album is a catch-all for his varied tastes.", "A lot has changed for ", " since 2012, when his mix album for Fabric pushed him beyond his residency at the London club. ", " struck a chord in the dance-music community with its omnivorous, no-nonsense selections. Featuring crowdpleasers like ", " and ", " along with underground stalwarts ", " and ", " (under his given name, JR Seaton), the mix reveled in Avery’s taste for big-room energy accentuated by more outré sounds. In 2013, Avery’s debut album, ", ", doubled down on that approach. It presented a powerful yet idiosyncratic amalgam of acid house, techno, and electro, a style Andrew Weatherall once ", " as “gimmick-free machine-funk of the highest order.” On the back of those two releases, Avery was soon appearing on stages around the world.", "“I like weirdness and oddness,” Avery said in a ", ", with one caveat: “I still want to be able to dance to what I make.” ", " for the most part struck that balance eloquently, and the following years found Avery experimenting. There was an ambient collaboration with synth artist and sometime ", " member ", "; a duo with the London producer Volte-Face, called Rote, offered dyed-in-the-wool European techno. Somewhere along the line, perhaps during his extended stay on the touring circuit, Avery’s music began changing.", "Five years after ", ", ", ", Avery’s second album, is mostly an inversion of the music he became known for; its swaggering electro beats smoothed into unchallenging techno precision, its chunky 303 sequences muted and slowed down, and its trampled pads brought into the foreground and given a thick wash of reverb. These new approaches are present across the tracklist, and yet a clear musical direction fails to emerge.", "Both “Sensation” and “Clear,” two early singles from 2015, are featured in the album’s first half, and they’re the least interesting wrinkles in the producer’s habitual approach. Only “Diminuendo” delivers similarly druggy, hard-tumbling techno, albeit with an added sense of tension and release that serves the banger well. Much of ", " is surprisingly understated, at least compared to ", ". There are a few run-of-the-mill ambient interludes, some introverted club oddities, and touches of soporific acid reminiscent of the German producer ", ".", "“Slow Fade” and “Quick Eternity” do the best with Avery’s variations upon subdued dance music, tying airy melodies, glowing pads, and resonant drum machines into a sound not unlike ", ". In fact, it’s damn near impossible to listen through ", " without drawing connections to Warp’s early catalog. The softly spooky “Days From Now” could’ve been lifted straight from ", ", while standout track “Citizen / Nowhere” sounds like a gorgeous homage to ", "-era ", ". An album full of this ", "-esque electronica would be fascinating in Avery’s hands, even if it meant less straightforward dance music to his name.", "Avery has taken a confident step forward in redefining his sound on his own terms, and he has made some remarkable new tracks in the process. Nearly every highlight, however, feels hermetically sealed—produced in a vacuum and unable to feed into or connect with the others. It turns ", " into a catch-all for Avery’s disparate experiments, something that less resembles a fully realized album than a dynamic, robust playlist from a seasoned DJ taking a break from the road."]},
{"artists": ["Forth Wanderers"], "album": ["Forth Wanderers"], "text": ["The Sub Pop debut from the New Jersey indie rock band arrives refreshingly well-formed. Their music has an urbane sensibility, one that feels not just older in age, but in sound.", "At a Montclair, New Jersey high school, guitarist Ben Guterl had a crush on a girl. So he sent a demo of instrumental sketches to that girl, vocalist Ava Trilling, who in kind returned them adorned with her own lyrics. Soon after, she became the frontwoman for his band of childhood friends.", "If this charming prologue sounds like a spec script for an indie teen movie, believe that ", " are kind of like the feel-good movie version of a suburban rock band. In 2014, before they even released an album of music, ", " tweeted about their songs. While Trilling finished up high school, Guterl and the rest of the band packed up for college. In between homework and keggers, they emailed each other more song fragments, patching them together during breaks. In that time, Forth Wanderers’ handful of records garnered praise from both college newspapers and ", ", (who deemed them “confident and untainted” young stars, naturally). So ", ", their Sub Pop debut, feels like the end of the montage and the beginning of something real.", "Of course, the reason Forth Wanderers attracted so much attention when they were teens was that their music did sound prodigious. Even as high schoolers, Guterl’s spry and smoky guitar lines and Trilling’s blunt, diaristic lyrics gave the band an urbane sensibility, one that feels not just older in age, but in sound. One of their early songs, “", ",” had the lazily intricate feel of ", " and the concise, emotional punch of ", ". Indeed, the heroes of ’90s indie rock haunt their music, but Forth Wanderers don’t seem interested in pure emulation: Their style feels unmannered; their tales of young-adult frustration would feel cutting and relatable in any decade.", "The driving force behind this timelessness is Trilling. Like a natural movie star, she doesn’t just light up a scene, she creates the very circumstances for a scene to feel special. Her first words on the album: “I am the one you think of when you’re with her.” On the page, the line is already acidic, but under the direction of Trilling’s cool, unperturbed delivery, it becomes more than just a clever comeback at a disappointing partner: With her steely voice, she conjures up the entire arc of a doomed relationship. Her bandmates, meanwhile, coax every ounce of emotion and energy from this story, their rhythms taut and athletic. Guterel, in particular, has an audible chemistry with Trilling. His scuzzy chords hone in on whatever mood she’s in, as if they’re boxers moving around each other in shadow play.", "The stories she tells—of the many beds she wakes up in, the faces that obsessed her, the bodies she’s tangled up with—capture a kind of grappling adolescence that’s hard to speak, write, or even make art about in a way that’s truthful or interesting. She relishes in unpleasant details, like the blood she draws from a lover’s tongue in the middle of a makeout on “Taste,” a track that in its entirety, with its sour guitars and forceful drums, feels just as cutting as that kiss.", "Yet, as visceral as the writing can get, and as tight as the band’s sound is, Forth Wanderers’ songs can melt into each other—both lyrically and sonically. Aside from the acoustic outing on “Be My Baby,” every track is built on the same sturdy arrangement of fuzzy guitar licks and shuffling bass and drums. And since Trilling’s lyrics are, at the moment, confined to a limited range of experience, it can make the album, as a whole, feel like one long run on sentence about the intricacies young love.", "Still, there is a vigor to their music that’s not just accomplished, but deeper than they might know. The band inhabits a space that can feel bigger than the sprawling tree-lined streets and byzantine freeways of their local inspiration. Instead, the place Trilling and her bandmates create is more personal, messier, and chaotic. They give musical cues to the growing pains of young adulthood that are relatable but never trite—their songs, like any you might’ve been obsessed with in high school, feel like a mirror held up to the all-consuming triumphs and heartbreaks of your own youth."]},
{"artists": ["Neil Young"], "album": ["Roxy - Tonight’s the Night Live"], "text": ["Best new reissue", "In 1973, Neil Young played the inaugural show at the Los Angeles club, The Roxy. The reissued recording captures a night that turned his famously bracing album into something warmer and vibrant.", "Walk the city blocks of Los Angeles and imagine its bohemian yesteryear, when strung-out sex parties and impromptu jamborees emanated from the storefronts and bungalows. ", "’s foothold in the musician circles of Topanga, Laurel Canyon, and Hollywood are well documented. Further proof of his contribution to the cultural fabric of Los Angeles is that he consecrated some of the city’s most celebrated clubs. A new reissue of live performances from his celebrated diamond in the rough, ", "—released in conjunction with Record Store Day—aims to recapture the intrigue tied up with Young’s tenure in L.A. in the early 1970s.", "When the now-famous nightclub The Roxy flung open its doors in West Hollywood in September 1973, Young and his band, the Santa Monica Flyers, were invited to be its inaugural live act. They were fresh out of a makeshift recording studio in Hollywood, where Young, pedal steel player Ben Keith, multi-instrumentalist Nils Lofgren, and the Crazy Horse rhythm of bassist section Billy Talbot and drummer Ralph Molina had been recording live jam sessions. These hours in the studio also served as a musical wake for two friends who’d recently died, Crazy Horse guitarist Danny Whitten and roadie Bruce Berry. Young meditates on the loss in its namesake opener: His friend had overdosed on heroin and cocaine, and Young identified too acutely with the tragedy: “Out on the mainline,” as he put it.", "Young and the Flyers spent the summer months of 1973 playing through their grief, forming the bones of what would become Young’S 1975 album ", " They worked from 11 p.m. until sunrise, cruising—or flying, if you will—down Santa Monica Boulevard to sleep off the daylight hours at the Sunset Marquis hotel. When they hit The Roxy with the brand new songs they’d been rehearsing for months, the group was a lockstep machine that propelled, for example, “Tonight’s the Night,” “Albuquerque,” and “Tired Eyes” from insular meditation on death and its trappings to an amped-up catharsis to adoring fans. In the studio, ", " was imposing and dark, it sliced through the speaker like a razor. Live, though, these songs from Young’s famous “Ditch Trilogy” become warmer, more vibrant and alive. It’s a testament to Young’s indelible songwriting that a slight alteration in speed or sound can change the emotional tenor of his songs, and it's what makes this reissue a worthy addition for both avid Young collectors and casual fans.", " imbues the songs with the spirit of a specific place in time, at the Sunset Strip’s newest digs, where Young’s soon-to-be label boss David Geffen was a face in the crowd. Young tips his hat to Geffen specifically in a chatty interlude included between “New Mama” and “Roll Another Number (For the Road),” and there are other improvised bridges like polka mainstay “Roll Out the Barrel,” which the audience audibly digs via claps and whoops. That a group of people could be so jubilant about songs they’d never heard before is unfathomable in today’s firehose of festival reunions, but it speaks to the magnitude of Young’s pull in 1973.", "The existence of alternative studio versions of ", " have long been the subject of much speculation among Young scholars. While this release won’t scratch that itch, it is still a perfect time capsule back to a wilder L.A., featuring nine songs from the original album played in a different order and in a more joyful spirit. \"Walk On,\" from Young's 1974 album ", ", appears too. If the original recordings of ", " are a honey and hash-soaked lamentation, ", " is a salve for such palpable tragedy in the grand tradition of a live communion."]},
{"artists": ["Dylan Carlson"], "album": ["Conquistador"], "text": ["The drone-metal titan’s “imaginary Western” fleshes out his talents as a storyteller, but this album of mostly solo electric guitar doesn’t feel as fully realized as his band Earth’s best work.", "During the last quarter-century, ", " has helped reshape the electric guitar’s possibilities not once, but twice. In the first phase of his band ", ", Carlson stood at the center of the duo’s ", ", with his creeping riffs and masterful control of distortion seeming to trace the outer reaches of infinity itself. Those records are landmarks and baselines. When Earth returned nearly a decade later as a full band, Carlson’s riffs were thin and refined, each elegant note landing like a ", ". He had found a new context for his regal, slow-motion language, one that underscored the drone inherent in primal blues. Those records are guideposts, a reminder that an innovator can always be reinvented.", "During the last five years, Carlson has entered another restless phase and turned to albums of primarily solo electric guitar, where the occasional collaborators are there mostly to add texture to his themes. As ", ", he has mined European ballads for ", " and ", ". Now, at last under his own name, Carlson has taken the next logical step and written what he ", " “an imaginary Western,” which wordlessly traces the historic story of a conquistador exploring what is now the American Southwest a half-millennium ago. The 32-minute ", " feels slight, especially against the landmarks of Carlson’s career, but it does open at least one intriguing avenue for future exploration.", " unfurls like a screenplay. The title track is an extended invocation in which a simple, central riff coils and loops and warps against a rising web of noise; we are, in essence, meeting the characters and imagining the tangle of possible plotlines and misfortunes they could encounter. With “When the Horses Were Shorn of Their Hooves,” the drama arrives in earnest. Carlson’s guitar is agitated and irascible, the riff practically showing its teeth and shaking its fists. Something very bad is bound to happen. But first, there’s a forced pause, a brief interlude for plucked lute and scraped cymbals. This is the itinerant widescreen scan of the foreboding scenery. You can imagine the rolling tumbleweed or hear a ", " in the distance.", "In Act II, things happen quickly: During “Scorpions in Their Mouth,” things go from bad to worse, and that stately theme from the opening “Conquistador” goes to battle. Carlson’s tone is bulbous and barbed, its growl harking back to those young, angry days in Earth. Then, at last, there’s an escape from danger to the halcyon coast, beautifully rendered in “Reaching the Gulf.” Carlson’s guitar seems to smile as it sighs, as our hero licks wounds that could have been much worse. Carlson is an efficient, effective storyteller, a trait that was never quite clear in Earth’s enormous impressionism.", "But ", ", like much of what Carlson has done outside of Earth, feels only like a second draft of an idea from his sketchbook, the transitional point to something that could be truly magnificent. The album suggests a full story, but it still seems paradoxically fragmentary. After its slow burn fades, after our hero has returned home, what’s best about ", " might be the sense of possibility it poses. Having scored an actual Western film with minimal guitar vignettes, here he has shaped his amplifier worship into an auditory Western largely for solo guitar.", "So what’s next in that stepwise process? A through-composed score for a big-budget Western or an actual Cormac McCarthy adaptation? Perhaps, but it’s more tantalizing to imagine Carlson taking the trail of fellow guitar hero ", ", who has turned ", " or ", " into fully realized, entirely immersive stage shows. Here’s a free idea for an expensive production for any ambitious arts presenter, then: Commission Carlson to fully realize his 21st-century Western. Otherwise, his ideas may continue to drift in this middle distance, and he’s too good for that."]},
{"artists": ["PeeWee Longway"], "album": ["Spaghetti Factory"], "text": ["On his latest mixtape, the Atlanta rapper uses his innate charisma and exacting eye for the details of the drug trade to court a national audience that has so far eluded him.", " was a star even before anyone had heard his music. In his recent ", ", ", " recalls that the rapper “was always this little, funny, charming nigga whom people just seemed to gravitate toward” and that his widely respected “dealings in the streets” earned him a deal with Gucci’s 1017 label without so much as a demo. Five years, 11 mixtapes, and one official album later, the diminutive former hustler, who was raised a few doors down from ", " in the since-demolished Jonesboro South projects, is one of Atlanta’s preeminent rappers. But, beloved as he is in rap’s most influential city, he has yet to ascend to the same heights as his former neighbor. With his latest mixtape, ", ", Longway is still seeking the national renown that keeps eluding him.", "He has two obvious strengths as a rapper: First, there’s his infectious charisma. He seems to have apprehended the crucial, if counterintuitive, lesson that gangster rap demands a sharp sense of humor. But there’s a fine line between making listeners giggle and becoming an exhausting punchline rapper, and Longway stays on the right side of it with lyrics that are plainly absurd and ribald. Central to the chorus of “Jumanji” is the frat-house refrain “rock out with my cock out.” On “Freestyle,” he’s both “shipping and handling through Amazon” and “putting dope dick on an Amazon.” “I Can’t Get Enough” follows up the line, “Iced out my teeth like I’m Mike Jones” with the spurious claim, “I don’t even talk with the lights on.”", "Longway’s second great asset is his exacting eye for the material details of the drug business. He relishes the minutiae, single-mindedly monitoring stovetops, hoarding residue for addicted product testers, and wrapping brick after brick after brick. On “Crop It,” he sets the scene of a cannabis-and-poppy-growing operation: “Poppy seeds in the sun room/Ain’t answerin’ my phone ‘til June/October, November, December they bloom/We rewrap in black balloons.”", "Unfortunately, that exacting eye doesn’t see much beyond avarice and black-market ambition. ", " is almost completely devoid of biographical or emotional details that would add depth beneath the songs’ charming veneer. Whether it’s due to studious avoidance of self-incrimination or a simple lack of artistic vision, this withholding is what separates Longway from Southern rap’s most compelling personalities. ", ", ", ", and ", " flesh out their oversized personas with street names, sadness, mentions of their loved ones, memories, and worries—the bits that make them who they are.", "It’s understandable to plead the fifth when ", " shines a light in your face and ", ", but that doesn’t have to mean eliding essential parts of yourself from your art. As recognizable as he is on record, with his high-pitched dope-boy checklists, and onscreen, with his gold rictus and “get money gut” (as ", " once dubbed his own belly), Longway remains a mystery. He might have seen every view from Atlanta’s curlicue Spaghetti Junction, sold every drug from Schedule I to IV, and loaded every caliber of ammunition into clips—but we still don’t know what effect any of it had on him. Longway may only find the audience he seeks, and that his talent deserves, when he steps back from the trap-house stove."]},
{"artists": ["Speedy Ortiz"], "album": ["Twerp Verse"], "text": ["Speedy Ortiz’s third album is wry, acerbic, and full of hidden hooks. The songwriting of singer-guitarist Sadie Dupuis has hit a new peak of clarity.", "Sadie Dupuis has a knack for flipping the aperçu into self-fulfilling prophecy. “I’m blessed with perfect pitch/I waste it on songs that you never even heard of,” the singer-guitarist taunts on ", ". Even better is: “You hate the title but you’re diggin’ the song,” which isn’t actually prophetic because you can praise without equivocation ", "’s flair for the splendid title—this is a band whose ", " sported “Kinda Blew” and “Phish Phood.” Tense, knotted, suspicious of climaxes, their third official album is the right album at the right time for them.", "For one, Dupuis hits a new peak of clarity. Self-composure distinguishes her from the competition; she would rather trace the filigrees of a wryness as endemic to her as it is to forebears ", " and ", " than give the impression that the inarticulate and often clueless men who populate these songs bother her. As her melody line follows the sinews of the intro riff of “Can I Kiss You?,” she seems to think out the degrees of lust necessary to make her jump through hoops for the sake of a boy. On “Alone with Girls,” drummer Michael Falcone’s harmonies complement a story of abjuring the company of dumb dudes.", "The virtues of ", " may present a challenge to the uninitiated. There simply aren’t many hummable moments in the conventional sense; Speedy Ortiz don’t do those, or, rather, their songs act as Trojan horses from which hooks suddenly appear. Dupuis and occasional guitarist Andy Molholt love riffs, and when they tangle in the outro of “Moving In” the result is a beautiful cacophony. “Backslidin’” depends on a distorted slide riff. Although she has occasionally colored tunes with keyboards, ", " has explicit uses for them. The synth in “You Hate the Title” nods toward ", ", and is all the better for it. Suspicious of hysteria, Dupuis is content to repeat the title as if it were a mantra, not a hook. “Lean in When I Suffer,” almost as memorable, lurches like a car with bad shocks; its movement ", " the hook.", "So, while ", " offers no tune as stick-like-glue as ", " “", "” or ", "’s “Plough” it offers compensatory pleasures. They’re the kind of band whose lyrics, I like to imagine, would appear as witticisms in high school yearbooks—a shared passion of Saoirse Ronan and Timothée Chalamet’s otherwise incompatible characters in ", "; A band out of which cults are made. Speedy Ortiz record albums as shared secrets between themselves and fans."]},
{"artists": ["Princess Nokia"], "album": ["A Girl Cried Red"], "text": ["The latest mixtape from Destiny Frasqueri pulls from her love of emo and alt-rock. It’s an underdeveloped but strangely addictive left-turn.", "“Everybody wants to put on this façade that they all have it together,” ", " told fans during ", " this past January. “And I wanted to write a mixtape that was about falling apart and being a fucking mess.”", "Enter ", ", an inchoate but strangely addictive 21 minutes of pure and messy emotions from the shape-shifting New York City rapper born Destiny Frasqueri. Having already covered ", ", ", ", ", ", ", ", ", ", and many points in-between, Princess Nokia has now leaned into the formative sounds of her middle-school years to make an emo mixtape that doesn’t sound like emo or rap or even emo-rap. Rather, it’s as if pop-punk and cloud-rap got caught in a flash flood of melancholy and were forced to share an umbrella.", "In the hands of another artist, ", " might seem like a gimmick, but Princess Nokia’s strongest currency has always been her realness—she’s the kind of performer who’d ", ", the kind of straphanger who wouldn’t think twice about ", ", the kind of granddaughter who’d step upstairs to the roof for a smoke break and Instagram Live chat with her fans so as not to bother her Puerto Rican grandfather taking refuge in her apartment post-hurricane. So when she says that rock is her favorite genre, which she often has, you believe her.", "She’s traded her signature stream-of-consciousness flow and honeyed-soul vocal stylings for a Midwestern monotone. It’s not a seamless transition: “Flowers and Rope” has the brevity of a punk song, leaving its ends frayed and waving into the next track rather than resolved and resonating from an explosion of angsty screams and cymbal crashes. Something’s missing, but maybe intentionally so—it’s a song about emptiness after all, and this is communicated effectively, both lyrically and aesthetically.", "“Your Eyes Are Bleeding” is a bit more realized, awash in textures and sentiments of heartache and loneliness that bore into the brain like an earworm that’s all mood. “Look Up Kid” and “Little Angel” find Princess Nokia drawing from her own troubled past to connect with young fans that might be hurting in new but familiar ways with a message of hope and understanding. Both tracks make effective use of warm guitar tones melting in and out of icy beats.", "A trio of less rock-driven songs feels more self-reflective, touching on how Frasqueri’s life has changed since last year’s ", " of her 2016 breakout mixtape ", ". The tidy production leaves room for her to lay bare the most tangled aspects of the “fucking mess” she finds herself in these days. In a way, they serve as a solid argument that money buys sadness: The heavily Auto-Tuned “For the Night” contains the mix’s most candid (and satisfyingly shout-along-able) line—“I make money to replace you/Used to love you, now I hate you.” The appropriately titled “Morphine” is the biggest downer, full of concrete cries for help like, “I’m an emo little boy and I want someone to hold me/Got my money like a blanket and I hold it when I’m lonely.” The glitchy “At the Top” finds the songwriter at her most self-assured but still on message—it’s lonely up there after all.", "Considering the wide left turn this mixtape is taking—her fourth in a series of eclectic swerves from 2014’s ", " to 2015’s ", " to 2016’s ", "—it feels as if Princess Nokia is still in an experimental stage, hasn’t found her authentic voice. Perhaps “change” is her voice as much as it is punk, evidenced by an unwavering “girls to the front” ethos, bruja feminism, and independent spirit—not to mention the middle finger salute with a smile she’s serving on the cover of ", ".", "Taken together with her other albums, it’s a part of a motley crew of modes that is shaping Princess Nokia into a great experimentalist. On its own, it lacks the completeness of a coherent project of genre hybridization, and lacks a standout single on the level of, say, “", "” or “", ".” But, then again, it’s inevitable that an emo-inspired mixtape would have fewer bops than one inspired by classic NYC hip-hop. And the enthusiasm with which she revisits the music that made her is contagious."]},
{"artists": ["Mouse on Mars"], "album": ["Dimensional People"], "text": ["Mouse on Mars’ latest is a 43-minute suite broken up by short movements featuring a wide array of guests. The duo’s try-anything spirit remains embedded in every note.", "Across the last quarter-century, ", " and ", " have moved from dense noise to sleek electro-pop to carefully arranged post-rock, equally comfortable with wispy ambient tracks and banging dance tunes. While certain threads run through the German duo’s work—playful humor, an off-kilter rhythmic sensibility, an ear for colorful electronic texture—they never codified their quirks and sensibilities into a single identifiable aesthetic. There is no one sound of ", ". For devoted fans, that’s a good thing, because you never know exactly what their next album is going to sound like. But their eclecticism has also confined them to a certain cult status. Their latest, ", ", once again sounds unlike anything else they’ve made, the try-anything spirit of Mouse on Mars remains embedded in every note.", "This appears at first glance to be a genre of album with a long history: DJ + All-Star Guests. From the ", " to ", " to ", ", electronic producers have created album-length statements by working with rappers and indie rock artists of various stripes. This sort of record has had a checkered history, yielding some great singles and its share of duds. But while contributions here from ", "’s ", ", ", "’s ", ", ", ", ", "’s ", " and ", ", and more slot it within this shaky tradition, ", " is far more coherent as a single statement than that might suggest. Mouse on Mars integrate their guests into the larger project, rather than giving them space to shine on their own. The contributors become building blocks in service of arrangement, which mostly works to the record’s advantage.", " emerged out of a heady ", " involving robots, live musicians, specialized software, and an immersive speaker setup. The essence of the project was its modular nature—by recording the base material in the same key and tempo, the various parts could be shuffled, shifted, and folded together so it would still make sense as a single piece.Those established rules shape the feel of ", " in album format, as well. Instead of individual songs, it’s more of a 43-minute suite broken up by movements.", "The opening rattle of a woodblock—that’s a robotic instrument “playing” it—carries through the first four tracks. It’s a twitchy pulse that undergirds the music, as horns and strings and slide guitar move in and out. In some ways, this first section calls back to another period of Mouse on Mars’ history, the post-rock of the mid and late ’90s, where familiar instruments from the rock-band set-up were being used in ways that defied genre categorization. When the vocals enter, they are, appropriately enough, those of Justin Vernon, at whose Wisconsin studio a chunk of the album was recorded. As on much of the last Bon Iver album, ", ", Vernon’s voice is used as a sound rather than a vehicle for transmitting lyrics. His yelps and coos and wails are clipped and layered back upon themselves, and the words are both difficult to make out and beside the point.", "Vernon’s contributions to the early passages (he also adds guitar) reflect the album at its best, when guests retain hints of their musical personality but are subsumed within the larger structure. Stemming from that are “", "” and “Aviation,” which feature vocals from ", " and Spank Rock, respectively. These tracks are deeply weird and wonderful, mixing a profanity-laced rap, harmonized vocals that sound like ", " in a blender, and gorgeous swells of pedal steel guitar. It’s nothing you’ve heard but it’s also intensely musical, an affecting masterpiece of arranged parts.", "As the album moves on, the flow becomes oblong and harder to parse. ", " brings his Appalachian folk obsessions to “Parliament of Aliens Part I,” where his vocals are mixed with a sawing violin and a swell of voices that sound as if they’re being processed through a Buchla synth. Where the old world/new world mashup of the record’s first half comes off like an effortless hybrid, the Amidon track feels like a fragment. But the handful of skippable sections aren’t really an issue on an album that moves along so briskly. In the back half, “Resumé,” featuring septuagenarian R&B eccentric Swamp Dogg, brings to mind Daft Punk’s “Giorgio by Moroder,” as the vocalist offers observations on his past over music that is constantly building and falling apart. By the time the record winds down it reveals itself to be a kind of meditation on American music, with pronounced elements of rock, jazz, folk, blues, rap, and minimalism all tied together with a ", "-like flair. But it arrives at this whole in a sneaky way, and it manages to avoid feeling like a concept album, or like anything else Mouse on Mars, or anyone, have done."]},
{"artists": ["Ricky Eat Acid"], "album": ["am i happy, singing_"], "text": ["On this three-track album from Sam Ray’s electronic project, originally recorded in 2014, samples are absent and stillness is the move.", "Playlist culture suggests that we take our music with a side of multitasking—or perhaps, the other way around. Spotify, for instance, perpetuates this idea with its “Genres & Moods” section, featuring efficiently labeled playlists for a range of daily activities: “Workout,” “Sleep,” “Dinner.” Listening to ", ", Sam Ray’s latest release under his electronic alias ", ", it’s reassuring to discover that none of its songs come remotely close to any of those categories.", "Originally written and recorded as a rough draft in 2014, ", " was laid down in just three days. Ray has said he considered releasing the album immediately, but was advised to spend more time with it, later devoting months to retouching and re-tooling the work in a manner he likens to “reshaping a lump of clay, or chipping away at a hunk o’ marble to make a better statue.” In the four years since that initial recording, the Maryland composer/producer has developed a reputation as an eclectic, oddball bedroom-pop auteur as fans have discovered Ricky Eat Acid releases like 2014’s ", " and 2016’s ", ", as well as full-lengths from his low-fi folk project ", " and his indie rock band ", " (FKA ", ").", " marks a sharp detour from the sample-heavy approach that has united much of Ray’s previous work. ", " memorably repurposed a cover of a ", " and ", " duet, a fire and brimstone radio sermon, and countless collaged vocals; American Pleasure Club’s recent ", " flips ", "’s version of “", ".” Every note of ", ", however, is original—the only samples present are those borrowing from Ray’s own compositions. Like an audio magpie, he has been amassing these sound scraps for years, hoarding excerpts from string quartets and cataloging every plink of piano. With a slow and steady hand, Ray stitched these varied elements together. The result is a collection of arresting sonics that resist passive listening, instead commanding undivided attention.", "Opening track “‘sitting in a diner’” is one of the most difficult pieces Ray has released to date, but in this case “difficult” and “beautiful” are not mutually exclusive terms. The song doesn’t so much begin as erupt, bursting like a glitter cannon loaded with shards of broken mirror. An early listen caused me to wonder if my speakers were shorting out, but the patchwork of noise is fragmented by design. It is a gorgeous assault on the eardrums, intercutting complete silence with 808 chirps that sound like ", " leaping through a row of coins.", "His use of homegrown samples throughout ", ", and the months he spent finessing the record, illustrate heightened discipline for someone who’d already churned out dozens of Bandcamp albums by the time he recorded it. That discipline pays off: ", " is among Ray’s most cohesive recordings, playing like a linear triptych rather than a scrapbook. Thematically, too, it represents a development. Works like ", " and ", " conveyed a narrative sense of place, memory, and motion. Cuts like “Driving alone past roadwork at night” and “Spinning About Under the Bright Light in Bliss” evoked filmic tableaus filtered through the grainy glow of nostalgia—one could easily imagine taking a midnight road trip, or making out in a drunken stupor.", ", on the other hand, requires absolute stillness. It’s too jarring to score mundane activities, and too interesting to be relegated to playlists like “Hanging Out and Relaxing” or “Wine & Dine.” “two_beautiful ways of moving_your_hands” may be fabricated with gorgeous strings, but their incomplete, looped phrases arouse an intense yearning for them to fully bloom. It is a sensation I can only liken to the blushing tension between a “good night” and a first kiss. The anticipation escalates when the audio cuts out for a full four seconds, an eternity in song time. As a listener, you are hanging on every note, or lack thereof.", "The album’s final, 17-minute movement, “am i happy, singing_,” is some of the lushest music Ray has ever made. Harmonica-like wails stretch across lambent synths, and static surges under minimalist piano like a hissing river. A halo of birdsong drifts around the perimeter. It is the record’s most musical and naturalistic offering, and feels particularly well-earned given the prior turbulence. By the time we reach its closing minutes, ", " has migrated miles from its initial commotion. Even in stillness, we are still moving."]},
{"artists": ["DRINKS"], "album": ["Hippo Lite"], "text": ["Cate Le Bon and Tim Presley sound blissfully removed on their second album as a duo, in a quizzical world of their own creation. This one’s best played late at night.", "It is increasingly impossible, these days, to feel truly alone. But ", " and ", " found a way, and on their second record as ", " it shows. Le Bon and Presley are each psychedelic geniuses of the 2010s: the former, a wondrous Welsh singer-songwriter and ", " producer of ", "’s new album; the latter, one of the sharper writers to emerge from the homespun California garage rock scene. For ", ", they retreated to a commune called Saint-Hippolyte-du-Fort in southern France, a place known for its ancient fountains and silk museum—with, they mention, no wifi. DRINKS sound blissfully removed, in a quizzical world of their own creation. For that reason, ", " is best played in the late, isolated depths of night.", " is an album of peculiar grace: a mini-odyssey in quiet post-punk experimentation, brought to life with playfulness, eccentricity, and sly compositional sophistication. Madcap ideas are caught in mind-warping feedback loops. Batshit humor is mixed with the heart-tugging beauty of lovely, fingerpicked ballads. Atonal strings are lit up by strands of clever melodies, sung alternately by Le Bon or Presley. All of ", "’s strange sounds—a baby crying, a typewriter, a creaking door, ribbiting frogs, an inspired shaker—make it sound like a dada sound collage assembled in secret. For every classical element, there is a punk guitar, rudimentary beat, or wonky shout. Things that are “right” are constantly complicated by things that are “off.” Once you spend enough time inside the fragmented world of ", ", you’ll be caught wondering which is which.", "As on many fantastic post-punk albums, space is liberally employed, and you feel as though you are listening in on DRINKS as much as listening to them—a witness to a process happening in the next room. ", " can be thrillingly episodic, like the oddest edges of ", "’ ", " or contemporaries such as ", ". For Presley’s part, perhaps his daring tastes were honed as a member of ", " in 2006. (He impressed the infamously cantankerous ", " with his lack of ego: “I’ve never met a guitarist I really like,” Smith wrote of Presley in his memoir. “He’s alright though.”) Describing DRINKS’ process, Presley has said in interviews that he’ll bring an idea and Le Bon will deconstruct it: “She’ll flip an idea upside down and look at it from a totally strange perspective... She comes out of Mars with ideas.” “Blue From the Dark” sounds like a twisted music-box. The slowly fragmenting piano figure of “When I Was Young” recalls an old black-and-white home movie. Surreal images lurk in every corner—when Presley mutters “do not mince words” on “Leave the Lights On,” it’s a riot.", "The proper songs on ", " are the droll kind you might imagine DRINKS’ Drag City labelmate ", " digging conceptually—honoring absurdity, stoicism, and humor at once, with an ethos of askew minimalism. Their wordplay is clever and often poetic. In the Le Bon-sung merry-go-round of “Real Outside,” it is immediately clear that “real” is qualifying “outside,” as in, it seems, outside society. “I wanna rest in the letter/Written outside/Your house,” Le Bon sings, a typically puzzling image. On the somnambulant “Pink or Die,” she recalls ", " with a line of especially elemental power: “Hallelujah nights/Winter sounds sincere/I am the color of here.” The closer, “You Could Be Better,” feels subtly political as Presley lists out all of the things you “could be” (“picture,” “ladder,” “bible”) and proclaims “everything edible eats you alive,” perhaps a way of saying that everything happens so much.", "At the center and peak of ", " is “Greasing Up,” a staid and swaying folk tune, a composed foil to the freakery of its surroundings. “Greasing Up” sounds older than it is, and it rings of discovery in process, like finding a perfect book in the attic that you did not know was there, caked in dust. “If I decide/To come back to life,” Presley sings solemnly, “To be wide-eyed/Motion in mind/Cousins outside.” It comes over like an ode to their practice and to the willingness to stay inspired—and with that, to all creative practice that perseveres for its own sake. At a point, Presley conjures the lyrical image of “an orchestra/playing with you,” and there is not one present, but what a moving suggestion. “Greasing Up” carries a similar elegance, set only slightly aslant by the discordant drone that hums underneath.", "“The world is absolute nonsense,” Le Bon ", " in 2016 around her excellent ", " album. “And things can be important to you, but you should never expect them to be important to other people.” There are grains of truth in that. ", ", however, feels like a precise instance of outsiders in communion—and the mysticism that occurs when weirdos help magnify the unconventional beauty of this absurd existence together."]},
{"artists": ["Lena Willikens"], "album": ["Selectors 005"], "text": ["The German DJ offers a spellbinding summary of her sound with this compilation of slow, ominous machine grooves. It’s a cross-section of her record collection, but also a map of a community.", "Dekmantel’s ", " series is an unusual proposition. Though a DJ helms each installment, they are compilations, not mixes. The theme varies according to the selector. Germany’s ", " summed up his soulful predilections by licensing a bunch of decades-old, out-of-print house music; the Berghain resident ", " highlighted his industrial roots with tracks from Front 242, ", ", and Clan of Xymox. The franchise is a bit like ", " or ", ", just for people that drop their monthly grocery budget on rare 12\"s on Discogs.", "The concept is an outgrowth of the recent trend for “selector”-style DJs, said to dig deeper than their merely crowd-pleasing peers. (Dekmantel, a Dutch label and events outfit, also has a spin-off festival, ", ", dedicated to the same.) On its face, unearthing seldom-heard records might seem to be a basic part of the DJ’s job; that it has been deemed worthy of notice says something about the state of dance music, where the quality of surprise has been downgraded to a nice-to-have rather than an essential component.", "But if anyone deserves the tag, the German DJ ", " does. Her style of playing—slow and ominous, given to grinding machine grooves and clammy atmospheres—is unusually distinctive. She honed her chops as a resident at Düsseldorf’s famously eclectic Salon des Amateurs, a club known for its wide-open musical policy, and her sets are full of curveballs and head-scratchers, the sorts of tracks Shazam can’t begin to puzzle out.", "That Willikens has released very little original music under her name makes ", " feel even more worthwhile as a rare opportunity to hear the world through her ears. At Barcelona’s Sónar last year, she turned a daytime, outdoor slot usually reserved for feel-good grooves into a ", ", meting out bone-chilling EBM that stubbornly refused to break a sweat. Here, too, the tempos tend toward cryogenic. Minor keys predominate, and textures are resolutely analog, favoring unvarnished drum machines, gravelly synths, and an omnipresent lo-fi sheen.", "Willikens’ repertoire is heavy on material given to her by friends and peers, and that’s largely what she’s chosen to run with here, filling half of ", " with exclusive tracks. The grimly droning “Sepses” is by a German duo, Garland, so unknown that as of this writing, they don’t even have their own Discogs entry. Willikens first encountered the Romanian producer Borusiade, whose paranoid coldwave fugue “Night Drive (An Exercise in Indulgence)” is a standout, through one of her DJ sets on SoundCloud. It’s striking how many tracks come with a personal story attached—a chance encounter and a shared musical affinity that led to a friendship. You get the sense that Willikens’ sets aren’t just a representation of her own tastes. They are a manifestation of a shared aesthetic, a map of a community.", "When it comes to the previously released music here, none of her rarities are all that rare; many of them could be had for a few dollars, assuming you knew to look for them in the first place. “Morning Star (Dubmix)” is a 1996 track by Sandoz, a dubby alter ego of ", "’s Richard H. Kirk, sourced from a dime-a-dozen electronic comp from the period. Vromb’s “Amalgame” is a sepulchral, slow-motion techno cut from 2001 that she discovered lurking in the Cologne record shop A-Musik’s dusty CD racks. Sysex’s excellent “Deep Space” has been hiding in plain sight for the past 24 years, tucked away on a long-forgotten CD anthology on ", "’s Plus 8 label. What’s so gratifying about all these is the way that, in context, they begin to flesh out the outlines of an idea. Heard on its own, “Amalgame” might not sound like much, just a minimalist variant on the kind of thing ", " did better. But here, it becomes part of a dialogue.", "That idea is best illustrated by Varoshi Fame’s “Voice of Command (Chekov Re-Edit),” the compilation’s absolute highlight. The song originally comes from a 1987 cassette on a Toronto industrial label; the pounding, hypnotic remix comes from Leeds’ Chekov, a rising producer who introduced himself to Willikens at one of her gigs and asked if he could send her his music. His instincts were on point: Piercing and percussive, laced with laser zaps and sinister shouts, his edit navigates past and present in a way that’s perfectly in keeping with Willikens’ tarnished psychedelia. And without her curatorial hand, we might never have heard it at all."]},
{"artists": ["Littlebabyangel"], "album": ["Gada"], "text": ["The debut tape from the Montreal vocalist and producer is a daring, eclectic mix of experimental R&B, where intoxicated club nights bleed into sunglasses-and-Advil mornings.", "In a ", ", LuckyMe co-founder Dominic Flannigan described the Glasgow label’s strategy toward releases, saying, “We are quite slow at putting out records. Part of that is because we sign artists, not records.” This long-game approach, which feels delightfully anachronistic in today’s industry, prioritizes development and explains why signees like ", " and ", " often spend several years making their full-length debuts. Major players have unsurprisingly taken notice, and many of LuckyMe’s artists have been tapped by household names including ", ", ", ", ", ", and more for behind-the-scenes work.", "Now three years after releasing Littlebabyangel’s “", ",” a menacing, post-", " anthem, and equally ominous follow-up single “", ",” the boundary-pushing label has shared Montreal vocalist and producer Stephan Armstrong’s debut tape exclusively through a mailing list. By foregoing traditional digital outlets, there’s an added sense of intimacy to ", ", which serves as a compelling introduction to the semi-elusive artist. He’s yet to give an interview, and his internet presence offers scant biographical details, but the 11 tracks here speak loudly for themselves without giving too much away.", "Featuring additional production by “childhood friend” Cameron Morse (who’s also worked with Montreal R&B singer and XO affiliate ", "), the project plunges listeners into a shadowy, hedonistic world, where intoxicated club nights bleed into sunglasses-and-Advil mornings. Over the course of the tape, he alternates between a purposely wan R&B croon and chest-boasting Autotuned half-raps, the latter of which lends to the most thrilling moments. “Bring me a goddess,” he demands over a squelching digital beat on “320k,” listing minks, diamonds, Dior, and Prada as his preferred spoils of war. The one-two punch of “@Cartier” and “GENEVIèVE” still sound every bit as ground-shaking, all rumbling low-end and glassy-eyed come-ons. On the former, he references ", "’s “Party and Bullshit,” turning the carefree hook into something more sinister.", "Just when you’ve pegged the singer as a cold-hearted, red-blooded Adonis, he lets his emotional guard down on “Love Animation” and “Crazy Mary,” dialing back the maelstrom electronics in favor of more atmospheric backdrops. It’s hard to tell whether he’s singing about one woman or multiple women, but the album’s sequencing creates a whiplash narrative of weekend after-parties and weekday heartbreak. The only break from the metaphorical storm is the somber piano instrumental “Supersky,” which clocks in at an all-too-brief minute and forty seconds, and feels like entering the eye of a hurricane.", "The slow-building closer “Los Angeles” is not only the tape’s most fleshed-out song, but perhaps the best summation of Littlebabyangel’s prodigious talent. There’s plenty of experimental flourishes—the track begins with the sounds of birdsong and gently falling rain, and ends with a breakdown resembling trance—but the tale of love gone amiss at its center is a premium display of pop songwriting. Two years ago, Scottish producer and early LuckyMe signee ", " ", " featuring Armstrong originally intended for ", "’s ", ", which would later become ", "’s sweeping, war atrocities critique “", ".” Whatever form his next move takes, ", " shows he won’t stay a secret for long."]},
{"artists": ["Robert Glasper", "Kaytranada"], "album": ["The ArtScience Remixes EP"], "text": ["This remix set, based on Glasper’s 2016 album, moves with the freewheeling rhythm of a beat tape. It’s a low-stakes but very fun session.", "You can trust ", " to honor your favorite throwback sounds. He’s the cool custodian of old-school grooves who, with his band, the ", ", has built a flourishing career out of reinterpreting African-American music history, bridging jazz, soul, R&B, and hip-hop. The two installments of his guest-heavy ", " series in 2012-2013 and 2016’s ", " all flowed like curated mixtapes of the finest vintage. On ", ", the keyboardist and producer probes another vital form of Black musical expression: the remix.", "Glasper has bowed down to the concept before. ", " saw his tracks flipped by old-world heads like ", ", ", ", ", ", and ", ". For ", ", the keyboardist plumps for just a single collaborator in 25-year-old Canadian ", ". Given his youth and his affinity for fizzing electronic textures, it’s not necessarily the most obvious choice. Yet Kaytranada has in the past shown plenty of respect for his golden age hip-hop forefathers, and that serves him well on this set. The remit of the remixer has always been simple enough to be scrawled on the back of a pack of cigarettes: keep the cuts fresh and keep them glorious. Here, Kaytranada finds enough new angles to make the project meaningful while staying true to Glasper’s long-term modus operandi. Spin these tracks out of context and the thought of alternative versions existing might never enter your head.", " moves with the freewheeling rhythm of a beat tape. The drums are crisp and the keys flow like liquid gold. These are tracks that would sound great crackling through your old Sony Walkman on a beat-up C-90. Take “Find You”: The jittery arcade electronics of the original have been dramatically stripped out and replaced by a cool, dusty groove that echoes ", "’s early beats. The thick, 1980s boogie-style orchestration of “Thinkin Bout You”—a sweet love song that captures being in a relationship when you’re touring—is now a fluid, dapper R&B number. “Written in Stone” features some classical-style piano chords before falling out of step as the vocals are slowed and screwed. It’s a welcome moment of tension in an otherwise satin-smooth set.", "The only real disappointment is “No One Like You.” The original nine-minute version focused on spontaneous jazz expression. Here, the borders of the song are reined in, with the vocals replaced by those of Alex Isley, imbuing the track with a more contemporary R&B feel. It’s fine in concept, but spoiled by a hyperactive drum loop that blemishes the record’s otherwise urbane groove.", " lasts for just 28 minutes and eight tracks, only five of which are fully functional songs. It’s even bookended by two daft but enjoyably absurd skits featuring Don Cheadle, who worked with Glasper on the ", " biopic ", ". As the stakes never feel particularly high, this will go down as a minor release in both Glasper and Kaytranada’s discographies.  Never mind—the timeless nature of these grooves is hard to grow bored of."]},
{"artists": ["A Perfect Circle"], "album": ["Eat the Elephant"], "text": ["On their first album in 14 years, art-metal giants Maynard James Keenan and Billy Howerdel swerve unexpectedly toward gloomy adult-alternative.", "Maynard James Keenan knows he’s kept you waiting, and he’s not sorry in the slightest. The singer crafted ", ", ", "’s first record in 14 years, according to the same principles as his self-run winery and restaurant in rural Arizona: time, investment, focus, presence. In a recent ", " ", ", Keenan compared himself to an Italian mother cooking up family dinner slowly and painstakingly, hungry children be damned. “When I start to dig into the content, the melodies, the words,” he explained, his chief feeling is “Get the fuck out. Dinner’s not ready, get out. Need the kids out of the kitchen!” The man’s philosophy as a winemaker offers a similar insight: “Rather than making ", " or ", " wines, we’re making ", " wines. You’re not gonna get ’em in 15 seconds.” A decade and a half—now that’s more like it.", "If Keenan is A Perfect Circle’s public face, Billy Howerdel—the group’s co-founder, songwriter, and multi-instrumentalist—is its true puppetmaster, presiding over the drama from on high. A former guitar tech for ", ", ", ", and ", ", Howerdel met Keenan when a then-unknown ", " opened for the iconic ska group Fishbone’s 1992 European tour, which he was working. He’s said that he originally conceived A Perfect Circle as a foray into female-fronted dream-pop, a pitch-black ", ". The band took on a heavier shape once Keenan hopped aboard, but the old primordial opulence remained in Howerdel’s bombastic riffs, symphonic arrangements, and dread-laden atmospherics. A rotating cast of all-star session musicians (Smashing Pumpkins’ ", ", ", "’s Troy Van Leeuwen, ", ") further buttressed the grandeur, elevating a two-man operation to supergroup status almost instantly on 2000’s hit debut ", ", one of the most stirring, successful albums in modern hard-rock history. Their 2003 follow-up, ", ", was a psychedelic-leaning concept set about addiction that confirmed A Perfect Circle as both hitmakers and experimental heavyweights. (Their third album, ", ", a collection of covers and reinterpreted material released in 2004, has more or less fallen by the wayside—which is unfortunate, since its lead single, “Passive,” is one of the finest crushers they’ve got on the books.)", "With ", ", Keenan and Howerdel have gone back to basics once more, though not in the way you might expect. As the first A Perfect Circle album recorded without special guests—save semi-anonymous major-label rock lifer Dave Sardy, who produced the set, and the mysterious “APC drum orchestra” credited with percussion—it re-establishes the co-founders’ chemistry as the band’s distinguishing trait. But where their previous three albums translated that dynamic into emotionally-charged metal, ", " assumes the form of a gloomy adult-alternative record flush with grand pianos, classical strings, and slackened tempos. Were it not for Keenan’s crooned politicking and the odd outburst, one could easily mistake it for the work of the British piano-rock outfit ", ".", "’s fatal flaws don’t take long to reveal themselves. The titular opening track more or less amounts to a hearty “fuck you” to the acolytes who’ve spent the past 14 years anticipating another powerhouse like 2000’s ", " or 2003’s ", " If the treacly pianos and plodding tempos don’t dampen diehards’ spirits, then the chorus certainly will. Keenan rattles off motivational cliches in an unintended, hilariously low-energy Shia LaBeouf impression: “Just take the stand,” he mewls, “Just take the swing/Just take the bite/Just go all in.” Previously-released singles “Disillusioned” and “TalkTalk” are similarly listless, relying on the driving verses for all momentum, only to undermine them with gratuitous, heavy-handed screeds against selfie culture (“We have been overrun by our animal desire/Addicts of the immediate keep us obedient and unaware/Feeding this mutation, this Pavlovian despair”) and that one holier-than-thou asshole glutting your Facebook feed (“Try braving the rain/Try lifting the stone/Try extending a hand/Try walkin’ your talk or GET THE FUCK OUT OF MY WAAAAY!”). That the band have framed ", " as a ", " on the importance of being present only makes the songs’ execution more befuddling: if A Perfect Circle wants listeners to walk away from the album vowing to “put the silicon obsession down” and reconnect with the world around them, then why top-load it with bloated ballads that are more likely to put them to sleep?", "’s extended “", "” bit, however grating, isn’t without its silver lining. A quarter-century into his career, Keenan has yet to falter where vocal technique is concerned: The guy could read the tax code in that honeyed falsetto and it’d still sound like a whispered revelation. Between the hairpin melodic turns, deep-throated runs, and silky melismas, his showing on mid-album cut “By and Down the River” is downright Olympian. The effortless choir-boy harmonies coursing through “So Long, and Thanks for All the Fish”—a sardonic, power-pop pep-rally heralding the coming apocalypse—supply a much-needed sugar spike. And while the piano-driven palette demotes Howerdel’s epic guitar solos to a supporting role throughout most of the album, “Feathers” and “Delicious” are pleasant exceptions. In a wasteland like this, you take what you can get."]},
{"artists": ["Denmark Vessey"], "album": ["Sun Go Nova"], "text": ["Detroit rapper Denmark Vessey lives in the haze. His ", " is freewheeling and exciting, the kind of hip-hop that breathes.", "It’s hard to reconcile our dependence on the sun with the fact that it will one day kill us. That day is not likely to be tomorrow, or the next day, or even a billion years from now. But even from a safe distance, knowing the sun, the fulcrum of life as we know it, will end life, is quite the headtrip. On ", ", Detroit rapper ", " is unfazed. Breezy, calm, and nonlinear, the brief collection skitters between the cosmic, the mundane, and the absurd with levity.", "Recorded during the same sessions as last year’s ", ", Vessey’s manic collaboration with Chicago producer Azarias, ", " is just as scatterbrained and wide-swinging. On “Zzzzz” Vessey uses his “counterfeit money phone” to make prank calls, threatens politicians that misuse tax money, and confronts a lover for sending too many texts. On “SunGoNova” he thanks ", " for explaining the risks of selling drugs and discloses his lady’s preferred pasta dish (pad thai). ", " wove such oddball minutia into a prickly, acerbic satire; ", " relishes their lack of connection.", "Vessey’s always been at ease rattling off non-sequiturs, and on ", " his rapping itself is free-wheeling. His verse on “SunGoNova” zigs from baby babble, to double-time raps, to sing-song chants. His opening verse on “Zzzzz” is interrupted by a fuzzy ad-lib that morphs into a hazy, shouted refrain. There’s a sense of freedom in all this spasming. In the past, Vessey’s anxiety raps filled his music with unresolvable tension. Even when joking or outright trolling, he could come across as grave. Here he achieves catharsis, his freeform flows easing him into bliss. “The sun went nova when we was sleep,” he deadpans on “Sellout.” He sounds relieved.", "Part of this relief is cooked into the record. The project is divided into two volumes. The first volume, produced by ", " and ", ", is a swamp of diced soul loops, dulled drums, and foggy chords. The arrangements are dense and feverish. Sounds are packed tight, melted down, and soaked in filters. Instead of rapping inside the crags and pockets of this teeming morass, Vessey orbits around it, using its warmth to forge his own rhythms, like a planet fostering life from a star’s light. Midway through the record, Vessey floats off entirely. The second volume is a rap-less, self-produced beat tape. Relative to Earl and Knxwledge, Vessey’s compositions are airy and porous; the drums strike cleanly, the samples breathe. His beats can jitter just as much as his raps, but the effect is similarly cathartic. “Halal Avocado Toast” shifts from a breezy tropical swing to a snappy bounce without fuss. “Quiet Storm Jam” casually hops from bass-heavy thump to a caramelized sample of Wendy Rene’s “After Laughter.” No beat goes unheard.", "The persistent aloofness of ", " sometimes blurs into triviality. Even if it’s considered a looser, sunnier counterpoint to the acidic dread of ", ", the lack of narrative and structure give the songs an unfinished feel. There’s no indication that his streams of conscious couldn’t have been whittled into coherence or that his beats couldn’t have been scaled up into something more robust. Freedom isn’t aimlessness. Still, there’s something relatable about Vessey’s restless self-indulgence. Why not live a little? The sun is going to kill us, after all."]},
{"artists": ["Panopticon"], "album": ["The Scars of Man on the Once Nameless Wilderness (I and II)"], "text": ["Minnesota-based musician Austin Lunn splits his love of black metal and Appalachian folk into two distinct halves on this double LP.", "When Austin Lunn seeks musical inspiration, he disappears into the wilderness: the rolling Kentucky hills where he learned the ropes of life and musicianship; the Norwegian mountain ranges where he pushed his earthly limits in adulthood; the perma-frosted Minnesota forests where he presently lives; and the music of ", ", his bluegrass-metal fusion band, where all the aforementioned scenes coalesce. “I live way out in the woods now and have really grown to love it and cherish the solitude,” Lunn told ", " in 2014, distancing himself from the project’s radical roots. “I feel like in a lot of ways the music reflects that...I am ready to focus on what I think is right and beautiful in this world.”", "In the Bandcamp ", " for Panopticon’s new double album, ", ", Lunn emphasizes his Luddite tendencies in earnest terms. He entreats us to avoid playing the album on laptops because “it will sound like shit,” warns us of its midway pivot to Appalachian folk, and suggests fans listen during a long hike or long evening by the campfire. Lest you misconstrue this as self-important nature-boy schtick (or, god forbid, “hipster metal”), know that Lunn isn’t particularly concerned with selling an image to the public. “NOT ONE SINGLE PERSON WAS ASKED TO REVIEW THIS ALBUM,” he vows on the same Bandcamp page. It’s an understandable note, considering that ", " features some of his riskiest, most intimate music to date.", "Lunn has a tendency to speak black-metal’s praises sensually, and almost invariably in terms of the physical environments that spawned his forebears. He’s described Falls of Rauros as making music that “smells of ocean breeze,” and singled out ", "’s iconic album ", " for evoking the Norwegian wilderness he beheld so long ago. ", " applies a similarly synesthetic approach, molding black metal into pastorals with vivid stories to match.", "Following a relaxing introduction to the wild on “Watch the Lights Fade,” a sparse instrumental comprising accordion sighs, crackling fires, and little else, Lunn unleashes hell with “Blätimen,” a stunning, nearly seven-minute ode to a Norwegian black metal musician who froze to death walking home through the woods. Lunn conjures a Scandanavian blizzard with hollow, weeping riffs bursting into the sonic space like wind gusts as the blast-beats shatter around him. “The Moss Beneath the Snow” proves more literal in its naturalism, concealing the coming maelstrom beneath a burbling brook; the placid interlude “A Ridge Where the Tall Pines Once Stood” pairs loon laughs with a soothing reading of the late environmentalist Sigurd Olson (who also ", " in the forest, in this case, while snowshoeing). The only things missing from this heavy metal camping trip are the ", ".", "As Lunn foretold, the second half of ", " marks a sudden stylistic shift, with a majority of its eight songs swapping leaden fury for simple, understated Americana. None of them come even remotely close to capturing the drama of the first half. That’s partly because Lunn’s homespun mix buries his hoarse melodies beneath squeaky bluegrass tracking on otherwise-solid songs like “The Wandering Ghost,” and partly because the merger of fury and folk (emphasis on the fury) is what makes Panopticon so compelling in the first place. To cleave his sound in half is to weaken it, at least temporarily. Black metal and blue-collar country might come from two different lineages, but they’ve got more in common than you’d expect: the ever-present pain, the untameable spirit, the tragic beauty, the freedom to feel both everything at once and nothing at all. ", " works best when it stuns through synchronicity, rather than separation."]},
{"artists": ["J. Cole"], "album": ["KOD"], "text": ["With his fifth album, the North Carolina rapper aims for righteousness but often ends up sounding self-righteous instead.", "Listening to a ", " album can feel like listening to a very intense young lawyer attempt to win a difficult case. Throughout his career, Cole’s raps have often been self-serious and polemical, with their success depending on the overall strength of his argumentation above all else. And while many of his individual claims can be convincing, you often get to the end of a song and think something like: ", " Few artists stake so much on their ability to persuade an audience of their worldview, particularly when that worldview is so absolutist. You do not listen to J. Cole to enjoy his wit or his stories, but to partake in his wisdom, which often involves an element of moral panic: On his new addiction-themed album, ", ", he loves to suggest that people should abstain from things—smoking, drinking, online dating. Sometimes, he’s persuasive, but just as often, he simply seems self-righteous.", "For a talented technical rapper with reverence for hip-hop’s history, Cole has never really been playful. (His previous album, ", ", was all about death.) Aside from his weakness for corny punchlines, his verses are frequently free of the word games that his top-tier peers revel in. But even so, Cole is capable of making a strong case for his beliefs. When he does, it’s thanks to the emotional appeals he embeds in certain songs. On “FRIENDS,” he confesses to his dependence on weed before calling out specific friends who abuse drugs; in asking them to stop, he mostly ditches his sanctimony. On another standout, “Kevin’s Heart,” Cole uses the pint-sized comedian’s very ", " to reflect on the challenge of monogamy: “My phone be blowing up/Temptations on my line/I stare at the screen a while before I press decline.” Cole is most effective when he keeps things personal rather than turning up his nose at the choices of others.", "Other songs work because of the North Carolina rapper’s technical ability and skill behind the boards. Previously, when Cole has wanted to make a statement, he’s asked all collaborators to leave the room. The new album, like his would-be magnum opus, ", ", is absent of other artists (save kiLL edward, a mysterious guest whose voice, when sped up, ", "), and Cole produced much of it himself. “ATM” and the title track are potent reminders of the way he can rip up a song with his flow alone. Cole is friends with ", ", and ", ", with its stripped-down production, snare-drum flows, and focus on virtue and vice, can feel like a pale shadow of ", " Unlike the ", ", Cole is far more predictable and accessible.", "Cole simplifies lust on “Photograph,” where he again reminds us that his ideal woman is a holy Madonna who is sexy but never shows too much skin. He’s thoughtlessly proud on “The Cut Off,” in which he commends himself for his generosity after talking about how tempted he is to become violent. And on “BRACKETS,” he boils down a complicated topic in order to make a difficult argument work. The song ends with the story of a mother who loses her son. On the day of her son’s funeral, she remembers she has to pay her taxes, which she believes indirectly funded his death. Much like DAMN., the song uses the cyclical nature of time to make a point—that taxes are evil. But unlike Kendrick, Cole jury-rigs the narrative to make his case. Specious as they may be, songs like “BRACKETS” help us understand Cole’s appeal: He unites his audience against bogeymen like taxes, or the government, or white teachers in black schools, or a new generation of rappers. If you agree that those things are unequivocally Bad, you might be willing to listen when he tells you what not to do.", "The most personal song on ", " is about his mother, Kay, and it combines the emotional appeal and evocative detail of the album’s best tracks with the selfishness of its worst. On “Once an Addict (Interlude),” Cole recalls his mom drinking too much after his stepfather had a child by another woman—even pinpointing the Marvin Gaye and Al Green songs she was listening to at the time—as he regrets his own callous reaction (“Why she always using me for a crutch?”). But while those elements make the song powerful, Cole expresses a surprising lack of empathy for his mother’s troubles, even with the benefit of hindsight, and is hamstrung by clumsy lines (“Maybe things get better with time, I heard it heals”). Listeners are asked to think about the rapper’s pain, rather than his mother’s.", "Kay has encouraged her younger son to use her struggles as a warning to others, which he has done in the past. But there’s more to her story. She worked hard raising two sons by herself, working as a mail carrier to the point where her feet ached. One of those sons became a successful rapper, bought her a house, granted her the opportunity to stop carrying mail and to pursue acting, to meet Barack Obama and Afeni Shakur. In its haste to show the ugliness of her addiction ", "’s portrait of her glosses over any and all explanatory or redemptive details. It misses many other things too, when it conflates healthy and abusive self-medication, or refuses to make a distinction between marijuana, alcohol, and harder drugs. Because Cole is so often trying to convince us, he frequently only tells one side of the story, concealing the full picture in order to win an argument that nobody started."]},
{"artists": ["War On Women"], "album": ["Capture the Flag"], "text": ["The hardcore-inspired alt-rock of War on Women’s second album is as blunt as reality. They’re not so much raging against the machine as blazing through the air that keeps it alive.", "On March 20, a month after ", ", a high school student in Great Mills, Md. fatally shot his 16-year-old ex-girlfriend, Jaelynn Willey. The same day, the Baltimore five-piece War On Women released “Lone Wolves,” the opening track of their second album, ", ". “They don’t care if you live/They don’t care if you die/It’s only ever been about control,” frontwoman Shawna Potter seethes. She has said the song is about gun control and “the terrorism of entitled, angry white men that isn’t called terrorism”; she almost called it “Pulse.” “Then the analysts wonder if he got enough hugs,” Potter sings, “Another cycle of ‘too early to mention guns.’”", "If, at best, subversive ideas can sneak into popular culture like a Trojan horse—with radical thought encoded rather than didactically stated—then War On Women pay this no mind. Their eviscerating alt-rock never backs down from the supposed trappings of protest music. War On Women state the facts. They are self-righteous. They point fingers. Activism is prominently at the heart of their screeds against the systematic plagues of patriarchy, racism, and capitalism. The enemy is everywhere. War On Women prioritize taking it down.", "Last summer, this uncompromising approach found War On Women thoroughly out-of-step at the roving mall-punk summit Warped Tour. In a groundbreaking move, they brought a booth to promote “Safer Spaces” and teach festival-goers about bystander intervention. “There’s actually very few people who do what War On Women do,” Kathleen Hanna said in an interview about the ", " song she lent vocals to, “YDTMHTL.” “We do such similar work in the world that I felt an immediate shorthand with them.”", "Like ", " in the 1990s, War On Women are on a fearless mission to change their subculture. (Potter, like Hanna, is herself an activist: She founded the Baltimore chapter of Hollaback!, the anti-street harassment nonprofit.) But while War On Women self-identify as a hardcore band, they largely slick their edges here, thanks in no small part to co-producer J. Robbins of post-hardcore progenitors ", ". The effect is accessible but merciless, more ", " than ", ", or a less aesthetically-minded ", ". Only a handful of War On Women’s new songs adopt the traditional markers of hardcore—aggression, d-beat rhythms, air-tight rage—though these are their best ones. Their fury makes topics like reproductive justice, racist monuments, and female genital mutilation sound as gnarled and unfriendly as they ought to: “You tie us up in red tape/It’s red because we’re soaking in blood,” Potter screams on “The Violence of Bureaucracy.” Potter once said that her dream lineup for Warped Tour would include ", ", Brody Dalle, Hole, Against Me!, and Katy Perry—all a testament to War On Women’s brick-heavy and yet manicured feminist rock schema, dynamic and massive.", "Potter measures her antagonizing shouts, metallic roars, and cool-headed singing through powerful lines like “Our existence is our resistance/And your fear of us is our ammunition.” The album’s title track pivots on a hurtling, thrilling refrain: “You wanna legislate it/But you can’t even name it!” Its shredded gang vocals are pure solidarity. This is the collective sound of people who have felt in the depths of their souls the non-negotiable need for abortion rights, the anxiety of a pregnancy test, how fucked it is to not be able to afford Plan B. The proverbial flag appears to be a symbol of everything patriarchy wants to strip away, just to wield power over you. ", " is the sound of brazenly, corporally, unrepentantly fighting back. Its peak comes among the mathy riffs and group screams of the Hanna-featuring “YDTMHTL.” The same way a mainstream band like Rage Against the Machine made it a visceral joy to ", " “Fuck you, I won’t do what you tell me,” War On Women make it life-affirming to empty your lungs in the name of their pitched rallying cry: “YOU DON’T TELL ME HOW TO LIVE!!!” War On Women are not raging against the machine so much as blazing through the very water and air that keep capitalist heteropatriarchy alive.", "’s lyrics can at times be so on-the-nose as to recall the earliest waves of women’s-lib folk and pop in the 1970s: “I’ll never, never be a silent woman,” Potter sings on the mid-tempo “Silence Is the Gift.” The most literal songs don’t always land. Still, the bleakness of the Trump era has carved space for them. A song called “Predator in Chief,” in which Potter sings of punching Nazis and the hypocrisy of the flag, can right now feel patently heroic. It is hopeful to imagine a room popping off to the sound of Potter wailing “I’ll show you the meaning of fear” or “Fuck this fucking rapist.”", "War On Women’s purpose is so clearly delineated on ", " that the band included a 16-page “companion workbook” with the album. The idea of making punk-adjacent music ", " to academia might seem antithetical to such an anti-authoritarian band, but the ", " workbook is remarkably illuminating. It (thankfully) does not set out to teach students about “punk,” but rather about the themes of the record, presenting lyrics, some context (Virginia Woolf and Audre Lorde are mentioned), and links to further reading. There is a series of incisive questions to accompany each song, with “Lone Wolves” suggesting the prompts: “How are misogyny, homophobia, and transphobia related?” “Connect the lyric ’too early to mention guns’ with a current article on the GOP reaction to gun violence,” and “How much money does the NRA donate to Republicans?” Whether in the form of homework, a festival performance, or this defiant album, the curriculum of War On Women ought to be widely assigned. We should arm teachers, and ourselves, with this."]},
{"artists": ["Gang of Four"], "album": ["Complicit EP"], "text": ["The crassly political EP from Andy Gill struggles to capture the power found in the band’s most potent statements.", "’s 40-year interrogation of complicity has been so thorough, pretty much anything the UK post-punk band has undertaken—signing to EMI, ", ", watching their ", "—became a sort of praxis. You could even view the band’s middling recent years—during which every original member departed save for guitarist Andy Gill—as a meta-narrative about the kind of brand maintenance required by late-stage capitalism. So when Gill came across a clip of presidential daughter Ivanka Trump ", " a CBS interviewer’s question about complicity regarding her father’s white-nationalist policies, how could he not reappropriate it?", "Cannily, Gill made his response the centerpiece of the band’s latest project, the rather thin ", " EP. The brittly funky “Ivanka (Things You Can’t Have)” forswears any legit commentary, settling for that very 21st-century form of discourse: dunking on someone. “Ivanka” feints at inhabiting her headspace, using a quote from the CBS interview (“I don’t know what it means to be complicit”) as a jump-off for some decently snide, but not particularly illuminating barbs. Then, like your Democratic uncle replying to a Chris Hayes tweet, things go off the rails. “In the morning Daddy wants me in his room/It’s where we get together,” winks singer John Sterry, “It’s not true that Daddy calls my name in stormy weather.”", "Amazingly, that isn’t the only song on the EP inspired by a television broadcast. Like a Marxist version of Ivanka’s father, Gill has also drawn creative energy from the endless time-fill of cable news. Opening track “Lucky”—the product of Gill watching “six white men in suits arguing about the stock markets”—is a thumping, treble-fuzz indictment of capitalism’s meritocracy myth that lands some glancing blows against its current captain. Gill enlists backing singers to provide the kind of ersatz-funk frisson found on 1982’s ", "; on the bridge, bassist Thomas McNeice affects some nauseating dubstep wubs. He gets to do some vintage post-punk bell-ringing on “I’m a Liar,” a wind-buffeted slog through our current digital winter. Sterry attempts some prophet-without-honor poignance (“They said I’m a liar/’Cause no one believes when the place is on fire”) before succumbing to the watery vocal processing.", "Though the band is planning a full-length follow-up, ", " doesn’t suggest that we’ll see much of Gang of Four’s particular strengths. In their prime, few acts were better at chronicling the thousands of ways we are induced to sell ourselves—and each other—out. Certainly no one else could make that kind of interrogation sound so crackling and immediate. ", ", however, is content to thumb its nose at particularly vile actors instead of considering the script they’ve been handed."]},
{"artists": ["Ras G & the Afrikan Space Program"], "album": ["Stargate Music"], "text": ["The L.A. beatmaker’s 11th release on Leaving Records moves between wobbly R&B loops, musique concrète, stoned sonic detours, and E.T.-friendly G-funk.", "Los Angeles beat warper ", " has spent the better part of the past decade flaunting his alien status, with titles like ", " and ", " accompanying disjointed productions as dizzying as the Milky Way. His copious output (including four albums in 2016 alone) places him in a constellation of prolific beatmakers like ", ", ", ", and ", ". But recently he’s been dropping back down to earth. ", ", his 11th release on Leaving Records, is dedicated (or “livicated,” according to Ras G’s terminology) “to the Womb-man...to the Vagina, The Stargate.”", "Ras G’s choice of theme places the album in a lineage extending through Gustave Courbet’s “", "” and ", "’s “", ",” but ", "’s concept comes across more as an abstract notion than a literal one; the album lopes through drunken R&B loops, musique concrète, stoned sonic detours, and E.T.-friendly G-funk. Opener “Primordial Water Formations 1” bears all the squelches and static from the dawn of electronic music, like a sonogram from INA-GRM. And the gurgling rhythms of “Water Broken (The Opening of the Stargate)” find Ras G making taffy of a vocal snippet that’s closer in execution to the destabilizing ring modulations of voices on ", "’s “", "” than to any of his Brainfeeder brothers.", "On “The Arrival,” Ras G uses playground handclaps (evocative of ", "’s “", "”) before veering off into a spongy space filled with vocal scatting, laser pulses, and alien radio signals squiggling in the mix. Throughout, Ras G tends to fidget about, and most pieces move on after just a few minutes, never ending up quite where they began. “Quest to Find Anu Stargate” packs the set’s heaviest wallop, but soon, diaphanous jazz chords looming behind the beat spread wider and an R&B coo gently muffles the kick, so that the track winds up feeling more like a drifter than a banger.", "The back half of the album becomes harder to pin down, as Ras G switches up styles every few minutes. Phased funk guitar loops, dusted flutes, melted vocal snippets, and flat-tire drum loops wobble in the mix, thumping erratically like sneakers in the dryer. Whether these sounds fizzle or snap, they soon give way to something new. An eerie group chant crops up near album’s end that could have been sampled from some strange, Osho-esque cult recording—which is perhaps only fitting. Bearing titles like “The Nector of Stargate (taste),” “Is It Lust or Love,” and “Heaven is between her legs... (Initiate the return),” ", " ultimately suggests that as much as Ras G positions himself as an astral traveller, he’s also an earthbound horndog."]},
{"artists": ["Kimbra"], "album": ["Primal Heart"], "text": ["The New Zealand musician’s third album is a collision of hard electronics with a touch of R&B. Though it contains moments of great power, it sounds like a work that’s stuck between two places.", "It’s been four years since ", " released ", " her audacious and futuristic second album, one that established her beyond just the ", " voice on ", "’s 2012 hit “", ".” That LP further ensconced the New Zealander born Kimbra Lee Johnson as a one-woman odd-pop machine; a producer, an arranger, a multi-instrumentalist, and a unique dynamo vocalist. Oddly, there has been little fanfare around the release of its follow-up ", ".", "Perhaps tellingly, this album comes at a transitional point in her live show. Kimbra has pared down her prior set-up with a full band to just a small rig where she programs beats alongside only two shrouded players. Her intention is to arrive at a simplistic core, relying majorly upon digital sounds. Outside of tour, she’s built her own studio in her new home of New York (since ", ", she’s moved from Los Angeles) and she’s further indulged her technical geekery alongside co-producer John Congleton, known for his work with St. Vincent and Nelly Furtado, among others.", "Kimbra insists that she’s given herself time for a more vulnerable phase of artistic growth. Her intention has been to strip away the bombast and locate her raw essence, hence the title ", ". The results show that she’s still unable to let her ideas breathe without suffocating them beneath layers of quirks and tricks. Despite the protracted process, the album sounds like a work that’s stuck between two places; reaching for a larger audience but clinging on to her offbeat nuances. In its quieter minutes, even Kimbra seems to have realized this. “Version of Me,” a standout, is a soft ballad that positions Kimbra at her most exposed. She sings about the human truth of never being the finished article. “There’s a better version of myself/Stay for the person I’ll be,” she pleads of a love interest. She could be asking the same question of her audience, or even of herself.", " is a collision of hard electronics with light sprinkles of au courant R&B making for Kimbra’s most mainstream statement yet. And though she’s described her approach in making this album as being one of “radical fearlessness,” the album contains only a few moments of power. On lead single “Everybody Knows,” she sings with great conviction about being “young and gullible.” It’s the sonic accompaniment to a ", " she wrote last October about experiences she and friends have had as women in studio environments. Conversely on “Human,” she juxtaposes that individualism by pining for another’s affections and validation to survive. The track happily reinvents a classic soul sound with little percussive ticks and booms, providing strong evidence of what ", " can be when the songs are restricted in scope and home in on one intention.", "However, her most ambitious efforts don’t quite reach their apex, causing her somewhat cocky assertions to land flat. On “Top of the World,” she semi-raps over a ", "-assisted beat that builds to a climax about limitless success. “Talk like I be the Messiah,” she says, with excessive hubris. It’s the kind of statement you want to root for by such a hugely talented artist. Her vocal delivery, however, isn’t fierce enough to pull it off. Other than a few attention-grabbing choruses, the results are largely limp."]},
{"artists": ["Half Waif"], "album": ["Lavender"], "text": ["A woozy dynamic of pushing people away while simultaneously drawing them close courses throughout ", ", a striking album of beautifully rendered and deeply layered synth-pop.", "Because Nandi Rose Plunkett is so generous with her voice it can be easy to overlook the complex systems of beats and instruments layered behind it. An album about love, familial legacy, and the inevitable decay of human life, ", " maintains an aversion to linear time. Plunkett’s grandmother, who was near the end of her life when ", " was recorded and has died since, stirs the titular flower in a pot on the stove and walks through her garden; Plunkett is carried in her mother’s arms like a child; a relationship with a lover appears cross-sectioned in the now, all its conflicts and joys open to the light. Past and future converge on this album, which so badly seeks resolution to the stories in which human beings perpetually ensnare themselves, and so deeply knows that these stories have no ends.", "The recursion Plunkett finds when she looks back at her family and forward into her own relationships manifests itself in the album’s instrumental loops and persistent choruses. Its crown jewel, “Silt,” climaxes with a lyric Plunkett sings over and over, each time more urgently. “If you’d only give me what I wanted,” she repeats, stretching the “me” out in the back of her throat to turn the words into a demand, while a shuffling backbeat whips the song into a frenzy. The effect is similar to what happens when ", " lacerates her vowels; it’s as if the voice has to break because it cannot contain the feeling put into it. Earlier in the song, Plunkett deploys a different vocal strategy: She runs a distant-sounding backup vocal through Auto-Tune, depleting her own voice of the nuance it can convey. The overdriven primary vocal and the diluted backing vocal mirror the duality she traces in her lyrics, where she sings, with a note of apology, “Nobody deserves me/I get lonely/I get angry.” Self-effacement and desire compete for space—Plunkett shrinks herself and then explodes herself, awash in what she wants and ultimately unafraid to ask for it.", "That dynamic, of pushing people away while simultaneously drawing them close, courses throughout ", ", Plunkett’s third album as ", ". It’s a central paradox of intimacy: No matter how much you’d like to dissolve yourself in someone’s love, you still have to return to the isolated body you’re forced to call home. Among these songs, Plunkett finds herself in opposition to those she cares about most at the same time she wants to unify with them. It’s not an irrational roadblock; it’s just a particular condition of being alive.", "Beneath her words, ", " ripples with the densest, most expansive production yet recorded under the Half Waif name. The album’s lyrics might stand out first because they are sung so clearly and with so much urgency, but Plunkett accomplishes a difficult feat in welding her voice to her backing tracks so that each song emerges as a singular organism. The jittery synth line on “Lilac House” juts into her percussive delivery, a subtle guitar riff pulses under her searching vocal melody on “", ",” and even the comparatively straightforward piano ballad “Back in Brooklyn” echoes the lyrics’ feeling of placelessness in the way Plunkett’s hands wander restlessly across the keys. Her voice dips in and out of its surroundings, and the surroundings reinforce the voice—the more you listen, the more they blend together as one. The courage necessary for making an album this emotionally raw bleeds into both the words Plunkett sings and the adventurous, far-reaching melodies through which she sings them.", "Through its weighty discussions of desire and love and the impossibility of complete resolution in any relationship, ", " cracks open a sense of freedom. It would be easy to get bogged down in these subjects, to give up, to make the album a monument to despair. Instead, Plunkett finds momentum in her songs, as if naming and dissecting the finer points of loving people somehow lifted its weight. There comes a point where you realize that devoting yourself to someone will lead to the suffering of one kind or another, and yet you surrender to it anyway. ", " hits upon that moment of surrender, holding its strange alchemy up to glitter in the light."]},
{"artists": ["The Caretaker"], "album": ["Everywhere at the End of Time - Stage 4"], "text": ["The fourth installment of Leyland Kirby’s six-part series as the Caretaker is his most visceral album yet, an ambient look at the degradation of music and memory.", "’s project as ", " wasn’t always about dementia. “Initially it was all about ghosts and memories,” the experimental producer ", " about what’s now his best-known musical alias. Named after the job title of Jack Nicholson’s doomed protagonist in Stanley Kubrick’s ", ", Kirby sampled old Jazz Age 78s to make the kind of eerily distorted dance tunes you could imagine haunting the Overlook Hotel. It was a spin on similar techniques Kirby employed on ", " and ", " in his main project ", ", but he later grew inspired by neurodegenerative diseases and studies on the positive effects of playing patients music from their youth. The Caretaker’s labyrinthine recordings suddenly found a new significance, and audience, with 2011’s ", ", a record instantly hailed as Kirby’s masterpiece and one where music and concept paired so perfectly it felt like they’d always been inseparable.", "Kirby must have felt similarly. In 2016, he went so far as “diagnosing” the Caretaker with dementia before announcing an ambitious multi-part finale to retire the project. Titled ", ", the project follows worsening stages of dementia through six releases over three years and is scheduled to end in 2019. It’s first three albums—", ", ", ", and ", "—felt like retreads of sounds and ideas the Caretaker’s earlier masterpiece already perfected. But if ", " trajectory felt predictable at the halfway point, the dark, disorienting ", " marks a total reconfiguration. It’s the Caretaker’s best record since ", " while evolving its sound in new and often frightening ways.", "The record represents the beginning of the “Post Awareness” stages of dementia, setting up the unreleased ", " and ", " by breaking down foundational qualities present since the project’s inception. Gone are the short, melancholy vignettes with wistful titles like “It’s just a burning memory” or “We don’t have many days.” They’re replaced by four soundscapes, each stretching past the 20-minute mark and all but one clinically dubbed “Post Awareness Confusions.” They capture the darkest, most damaged sounds in the project’s lifespan whether dwelling on one ghostly sample for minutes or violently accelerating through skipping melodies, similar to the ambient experimental touchstone, ", "’s ", ". ", " is likewise a record that makes you feel surrounded, making you a participant rather than an observer.", "This is all by design. Kirby has said that the project is", ". Songs and samples from his earlier records, particularly 1937’s “", ",” resurface now in a almost unrecognizable blurs. By continually returning to the same samples over the years, Kirby has subtly programmed many of them into our own memories. It pays off amid the recollections and second-guessing of ", ", where the simple act of remembering a sample can be filled with this sense of tragedy.", "While the three “Post Awareness Confusions” reach unexplored extremes for the Caretaker, the dreamlike “Temporary Bliss State” enters a new world entirely. Kirby leaves no trace whatsoever of the dusty 78 samples that define the project, warping whatever his source material was into pure ethereal abstraction. Twinkling, liquid melodies and gentle waves of noise make “Bliss State” even more disorienting than the harrowing “Confusions,” yet it is so beautiful it barely sounds like the Caretaker at all. While previous releases used cheerful samples to create tension, to suggest, as one carefree song on ", " put it, that “A losing battle is raging,” there’s a genuine sense of peace for once. It’s a welcome respite, but it also signals the loss of control from patients with dementia. Going just long enough to make you forget what came before, the abrupt end and jarring snap into the final “Confusion” only becomes more devastating.", "Dementia has seen increasing visibility in the years since Kirby first artistically approached the disease. Julianne Moore won an Oscar for portraying an early onset patient in 2014’s ", ", last year it received a rosy Disneyfication in Pixar’s ", ", while “Bojack Horseman” envisioned it through ", ". It’s on all our minds because it’s scary, unknowable, and hurts people we love in ways we can’t imagine. One of our natural responses to things like that has always been to turn them into art, but there’s always a risk of pale romanticization. ", " becomes much more empathetic because it offers no such romance as the Caretaker closes in on the end—only confusion, terror, and tragedy. Like the end of ", ", the “ghosts and memories” are taking over, and it’s as difficult to watch as it is to look away."]},
{"artists": ["Tinashe"], "album": ["Joyride"], "text": ["The long-delayed second album from Tinashe includes a handful of bulletproof bops but has arrived as a fragmented vision of the popstar’s many talents.", " first announced ", " back three years ago. It was right after the release of her major-label debut, ", ", an ambitious statement of dance pop, experimental R&B, and understated ballads that allowed her personality to shine through it all. Since then, her airy soprano was a proven vessel for ", ", and her music videos and live shows revealed a performer in the mold of pop music’s greats, some of whom have gone on to ", " ", " her as such. ", ", then, would ideally nudge Tinashe closer toward becoming the household name that her unflappable single “", "” and her telegenic charm all but fated her to be.", "And yet. Following an elongated stretch of PR nightmares, canceled tours, and a ", ", ", " arrives with less than half of the seven singles released in promotion for it. This is a partial blessing—a clean slate was necessary after misfires like the grossly misjudged Chris Brown feature “Player,” or last year’s stilted and ", " pop ballad “Flame.” But in keeping with its confused rollout, ", " stands as a fragmented vision of Tinashe’s talents, roving between forward-thinking R&B, paint-by-number pop, and airless filler with little sense of direction.", "But this is still a Tinashe album, and those don’t come without some bulletproof bops. She takes center stage on “Ooh La La,” which coasts on a sample of ", " and ", "’s 2002 slow jam “Dilemma.” The track’s recurring squeak of a mattress and bump-and-grind beat make for a breezy, summer-primed R&B sex song that’s among her best. ", " succeeds elsewhere when it draws from the same hypnagogic R&B that once earned her praise, like on the floaty, seductive “He Don’t Want It” and the So So Def-indebted deep cut “No Contest.”", "The brooding title track, meanwhile, fleshed out with spacious production and a dramatic strings outro, is one of the most complex arrangements ever to appear on a Tinashe song. It was the impetus for the album—one that ", " momentarily ", " ", " while ", " was in A&R purgatory. It’s stacked with an all-echoed-vocals chorus, menacingly delivered verses, and cavernous drums, nodding to ", "’s ", " as much as Rihanna’s ", ". It could have easily set the tone for an album of darkly experimental of pop-R&B, brazen and at the vanguard.", "Instead, ", " simply treads water. The dancehall confection “Me So Bad,” with a crooning ", " and lazily on-brand ", ", is the upbeat, just-fine radio grab that just might blare out of cars all summer. But in context, the song sounds like it was beamed in from a different album altogether. Lead single “No Drama”’s brash, rapped verses and lopsided beat flag it as a successor to the no-fucks pomp of “2 On,” only this time it’s hobbled by a dismal ", " verse and a joyless, repetitive chorus. The album feels flattened in a way that does Tinashe a disservice; her usual free-flowing variety of styles and textures feels oddly at a distance among ", "’s grab bag.", "The disjointedness is a shame, because Tinashe’s voice throughout remains as syrupy and adaptable as ever: She climbs to the highest reaches of her falsetto on “He Don’t Want It” and later drops to a deep, grainy tone on the hard-bitten, electric-guitar ballad “Salt.” In both instances, she sounds relaxed, even soulful. The artistry of her voice lies in those moments of versatility and charisma, but they’re too isolated across ", " to land with the kind of impact they deserve."]},
{"artists": [], "album": ["BC35: The 35 Year Anniversary of BC Studio"], "text": ["This live document from 2016 gathers members of Swans, Sonic Youth, and other underground vets to pay tribute to Martin Bisi, the iconic producer whose touch defined the sound of New York noise.", "In New York, a city where arts spaces are perpetually shuttering, lasting 35 years as a recording studio suggests no small potatoes. Hell, SoHo’s legendary Magic Shop saw just 28 birthdays, closing in 2016 with ", "’s ", " among the final albums tracked there. Not to say real estate on Crosby Street equates to Gowanus, Brooklyn, the neighborhood where Martin Bisi started running BC Studios in 1981, before he even turned 20. Surely, the disparity related to the nearby Gowanus Canal, a waste-filled commercial thoroughfare so repulsive it once earned the nickname Lavender Lake. Rumors swirled like oil slicks that the canal was a last stop for mafia victims. Once called the Gashouse District, Gowanus had become a post-war wasteland, complete with feral dogs and roving gangs, by the time the Manhattan-raised Bisi arrived.", "Thirty-five years later, the pollution remains (the canal was named an EPA Superfund site in 2010) but Gowanus suffers the predacious developmental fate of many New York neighborhoods. It wasn’t until 2015, well into the neighborhood’s gentrification—you could by then see a Whole Foods from the studio roof—that Bisi lost some teeth to muggers on the block. The fact that friends of the humble producer found it necessary to organize a Kickstarter to cover his medical expenses speaks to the demise of a thriving creative class in the city.", " emerged as a result of that fundraiser for Bisi’s medical bills: a compilation of live takes (and a few overdubs) spanning one weekend in January 2016. The credits read like a who’s who of New York’s experimental underground: members of ", ", ", ", ", ", ", ", Live Skull, Cop Shoot Cop, ", ", and many, many more gathered for a two-day session and show, with an audience present and participating (namely as a choir on the gorgeous ", " track “Downhill”). Mostly improvised, with a handful of pre-composed songs thrown in, it’s a sonic embodiment of risk-taking, rule-breaking, and antithesis that celebrates the endurance of a man and a space tied directly to New York’s noise, art-rock, punk, free jazz, hip-hop, and alternative movements.", "Across 13 tracks, Bisi demonstrates—as a producer, engineer, and general facilitator of the avant-garde—what’s made his name familiar to liner-notes obsessives and New York noise nerds for three and a half decades. Showcasing the opaque, roaring, visceral sound he’s come to epitomize, ", " acts as a totem to his enduring role in NYC’s rock mythos. If it’s not ", " living on a couch above the studio or the entire Zulu Nation crammed into the control room, it’s the very formation of the space that makes Bisi more than a footnote.", "In the late ’70s, a 17-year-old Bisi answered a ", " ad from bassist ", ", becoming a peripheral member of the bassist’s project Material. Laswell, meanwhile, bumped into ", " in their common East Village neighborhood, goading him to check out the group. Eno—who came to New York to produce the second ", " album—eventually caught a Material gig and brought Laswell into his fold. As Eno geared up to finish ", ", Bisi and Material sought a studio and living space. After another ", " ad, they landed at 232 3rd Street in Gowanus, an old factory building where Bisi still lives and works. Eno financed its recording gear. Bisi’s first real task as engineer, at what was then called OAO Studios, became sessions for ", ".", "There are gorgeous flashes of ambience on ", ", but a stronger common thread emerges via the 1978 Eno-produced compilation ", ", which came to define the Dada-esque no wave aesthetic and featured ", " and the Contortions, ", ", ", ", and ", ". Bisi went on to record or perform with all those acts under various permutations, from ", "’s collaboration with Peter Scherer to ", "’s work with Sonic Youth. The Sonic Youth records ", " and ", ", made at BC studios with Bisi credited as producer, marked a breakthrough for the space. (Sonic Youth credited the rooms as Before Christ.) Bob Bert, Sonic Youth’s drummer for ", ", appears on “Nowhere Near the Rainbow,” the opening track of ", ", alongside Stu Spasm, Skeleton Boy, Alyse Lamb, and Bisi himself. It is a disorienting melange of wonked-out electronics, pummeling, unpredictable percussion, feverish guitars, and disembodied vocals.", "It was the studio’s early experience with ", ", Fab Five Freddy, and other hip-hop musicians that initially drew the interest of Sonic Youth. The recording of ", "’s landmark 1983 ", " (the massive single “Rockit” using turntablist techniques) left Material and Bisi at a crossroads: Continue with the pop pedigree, or push further into the underground? Laswell left the space in the hands of Bisi, who dug deeper. It’s notable that Bisi’s mother, a concert pianist who specialized in the technically demanding compositions of Chopin and Liszt, represented “bourgeois aesthetics” and “bourgeois values,” as Bisi once put it. The rejection of virtuosity stands as a core value of much of Bisi’s recorded output, if not the New York underground itself. On ", ", the establishment resentment rings clear throughout and notably on “What a Jerk,” performed by EXCOP, an ensemble made up of Swans and Cop Shoot Cop alums: It’s a thundering, tom-driven song that chronicles the assault of a police officer and might be the strongest statement on the record.", "By 1990, Gowanus hit its nadir, seeing its population at its lowest in a century. Yet Bisi verged on another summit. In the wake of ", "’s major-label deal (thanks to the very A&R brokerage of Sonic Youth with Geffen) bands that gestated in storied New York dives like CBGB, Pyramid Club, Danceteria, Mudd Club, and Sin Club landed on majors. Improbably, Cop Shoot Cop released an EP, ", ", and an LP, ", ", on Interscope, both engineered by Bisi. New York alt-metal heroes ", " reportedly scored a $1 million advance with the same label and brought Bisi in (alongside Butch Vig) to track guitars on their third LP, ", ". In 1999, Bisi contributed engineering to ", "’s second LP, ", " * ", ", for Warner Brothers.", "At the turn of the century, his visibility at an all-time high, Bisi reaffirmed his commitment to the underground as a new wave of no wave and noise swept North Brooklyn. He worked on records for burgeoning labels such as Northern Spy and Sacred Bones while also finding credits on more established indies like Matador, Drag City, and Thrill Jockey. The bulk of his work with the latter label comes with ", ", the New York psych-rock band formed in 2005. They contributed a stirring, wailing guitar drone to ", ", “End of the Line,” a truly puzzling mix of beauty and pain.", "That is to say: There are few hooks across ", ". As is so often the case with music of this stripe, the energy and vitality shine through all the darkness and violence present. The severity of the gesture means as much as the sound. Aside from all the ", " and Swans worship, as a survey of Bisi’s journey, ", " gives an incomplete—how could it be anything else—but satisfying look. Though the lore often precedes him, Bisi and BC have made an indelible mark with the distinct sounds of his MCI mixing board and cavernous recording rooms. That’s no bad standing, especially for a scrappy New Yorker constantly rethinking his approach. Let’s hope he survives in Gowanus for another 35."]},
{"artists": ["nothing,nowhere."], "album": ["ruiner"], "text": ["The second album from the promising emo-rap project of Joe Mulherin is sometimes potent, but it buckles from a lack of conviction.", ", the 2017 debut from nothing,nowhere., was a sterling emo-rap hybrid in a year when the term became a cultural flashpoint. Vermont native Joe Mulherin’s project stood apart from the crowd through its relative understatement and sense of craft. Unlike the litany of provocateurs applying slapdash Warped Tour aesthetics to ", " flows, the 25-year-old caught the attention of both ", "’s Chris Carrabba and ", " off of a fluid blend of arpeggiated guitar curlicues ripped from emo forebears like ", " and ", ", cloud rap production in the vein of ", ", and a vocal style that flitted between the two with grace and dexterity.", "On, ", ", Mulherin adds a potentially welcoming bit of self-awareness but is hamstrung throughout by its depressive cousin, self-consciousness. Much of the lyrical content feels similar to that of ", " on its face: heartbreak, depression, isolation, the emo works. But where that album often wallowed in those topics, ", " finds Mulherin genuinely reflecting on them. “I’m fucking sick of writing all these sad songs,” he spits on the jaunty, autumnal title track, before crooning a chorus that reads like a dirtbag version of “Ms. Jackson”: “Oh no/What’s your momma gonna say when I tell her that I broke your heart.” It’s a far cry from “Clarity in Kerosene”’s visceral “I hope you choke in your sleep,” but it’s no less effective, and much less troubling. However, for too much of the album, ", " falls short of the conceptual task set out by that title track. Only six months after ", ", Mulherin is losing his confidence.", "It’s most noticeable in the production. Unlike ", "’s gothic spaciousness, the beat-making on ", "—handled again by Mulherin and Soundcloud mainstay ", "—foregrounds rhythm over melody, submerging Mulherin’s nimble guitar work under Three 6 Mafia for Dummies drum loops. When the guitar is central, such as on the loping, nostalgic “better,” it feels confined to this muted tone that dampens its emotional effect. The most frustrating result is “rejecter,” in which Mulherin’s self-lacerating emoting is sabotaged by amateurish sub-bass production that makes it sound like ", "’s “Doing It Wrong” as performed by the noir-pop of ", ".", "To go along with the production switch-up, Mulherin also gets in his own way vocally. He’s a far more expressive singer than rapper, but he nevertheless favors the latter on ", ", and his proficient but impersonal flow never quite makes up for the lack of melodic ", ". “hammer,” in particular, suffers from making the mistake of trying for braggadocio: “Play the guitar like a young Santana/Reppin’ VT like my name Bernie Sanders” wants to be a winking joke but scans as awkwardly self-conscious. Of course, at least he’s noticeable there; more often, like on the droning, boilerplate verses to “vacanter,” Mulherin sounds embarrassingly anonymous, lending unfortunate new meaning to the moniker “nothing,nowhere.”", "The sudden lack of conviction is all a little confusing, especially if you came to nothing,nowhere. from ", ". Considering his recent upgrade from Pete Wentz’s vanity label DCD2 to the emo big time of Fueled by Ramen, it’s tempting to chalk the muddling of Mulherin’s ambition up to A&R overwork, or a misguided attempt at crossover into the more glamorous, Xan cake-adorned corners of the Soundcloud rap universe. He does have a track coming out with dubstep ", ", known in sadboi circles through his Terror Reid alter ego and as a prominent collaborator with the more-horrorcore-than-emo $uicideBoy$. But it’s more likely that Mulherin is brushing against the essential contradiction of emo, and even rap: a radical genre too often held back by the limitations of regressive emotional content.", "It’s an aggravating album for how close it comes to pushing past its forefathers. On the record’s best track, “sayer,” petulant reflections on a relationship collapse into a shredded “there’s nothing to say now,” followed by what might be the project’s mission statement—“I never meant for this to happen/I turned regret into a habit.” Like its title track, it’s telling and rewarding in its reflexivity and yearning for atonement. Sadly, it never lasts. And through its lack of charisma, ", " unintentionally communicates that working through a depression offers far less inspiration to Mulherin than indulging it."]},
{"artists": ["Sting", "Shaggy"], "album": ["44/876"], "text": ["The reggae-lite collaboration between Sting and Shaggy is as professional, good-natured, and helplessly uncool as its billing promises.", "Why ", "? Presumably, if ", " wanted to go 50/50 on a reggae album, he had options. ", " is still in fine voice. ", " aren’t really the Wailers anymore, but Sting and the Wailers has a hell of a ring to it. And if he were looking to make a splash on the adult contemporary charts, ", " probably could have made it happen. But Shaggy? Mr. Boombastic? The guy who sings like he’s auditioning to voice a breakfast cereal character? Why?", "It turns out the two just really hit it off. Sting even refers to “my good friend Shaggy” early on the duo’s unlikely collaboration ", ", and the album never leaves any doubt that Sting means it. Just look at them posing on those motorcycles, like your parents in their most embarrassing vacation photo. Even when the material falls flat, as it frequently does, there’s some pleasure in picturing these two entirely unobjectionable personalities living their best lives, knocking back Coronas while gently busting each other’s chops with the superficial banter of Liam Neeson and his middle-age golf buddies in the ", " films. It’s such an old-man record you can almost feel your testosterone drop listening to it.", " is as professional, good-natured, and helplessly uncool as its billing promises. Does Sting feign a Caribbean accent? Yes, obviously. Does he fetishize white sandy beaches and honor the ghost of ", "? You know he does. Are there air horns? Yup—all those boxes are checked right out the gate on the opening title track, another inglorious addition to the canon of reggae songs about how great reggae music is. “It shakes me to my soul with a positive vibration, I start dreaming of Jamaica,” Sting sings, standing out like a fanny-packed tourist against unexpectedly contemporary pop-dancehall production fit for a Sean Kingston album. The track’s modern sheen is a fake-out; the rest of the record is more UB40 than Top 40.", "In ", " ", " ", ", Shaggy makes a crack about women getting pregnant to the album’s steamy single “Don’t Make Me Wait,” but by and large the Shaggy here is a far less randy one than the “It Wasn’t Me” Shaggy at the turn of the century. He’s not as miscast as he sounds on paper. Nobody will mistake him for one of reggae’s greats, but he’s a game performer, down for whatever the album throws at him, be it dub, rocksteady, or yacht rock. His toasts color otherwise colorless songs without disrupting the tasteful romantic vibe Sting sets so carefully. And while there’s some initial absurdity in hearing him opposite Sting, one of the stateliest and most humorless of all of rock elder statesmen, the album never acknowledges it, not even on “Morning is Coming,” where Sting is awoken by to the serene song of a nightingale… that happens to share the severe nasally voice of Shaggy.", "More often Sting is the one who sounds out of place. His voice has taken on a smoky hue that can work for him when he leans into it, especially on the jazzy, ", "-styled “Waiting for the Break of Day” or the torchy “Sad Trombone” (yes, that’s really the title, and no, it doesn’t get the reference). Yet every time he reaches for his higher registers he shows the limits of his range, inviting unflattering comparisons to his youthful heyday with ", ". There was a time when Sting legitimately could have nailed a designated reggae album, but his realistic window for that closed quite a while ago. Maybe that’s why so many of these songs, even the upbeat ones, dwell on missed opportunities and the passage of time.", "The great irony of ", " is, despite its inherent disposability, it’s actually one of Sting’s more enjoyable albums, simply because he’s actually having fun here. At times, the album almost feels like Sting’s treat to himself, a reward for all those grief-stricken song cycles, symphonic works, and that ", ". After decades of treating music as a solemn obligation, he deserves a little vacation, and ", " is as close as any Sting album has ever come to sounding like one. The music’s usually pretty lame, but at least the company is nice."]},
{"artists": ["International Harvester"], "album": ["Remains"], "text": ["Across two studio albums and three discs of unreleased live material, the late-1960s Swedish free-music collective goes in hard on repetitive, mind-expanding psychedelic jams.", "In the late 1960s, a pioneering Swedish collective made music so free and open-ended that even its identity fluctuated. Sprouting from the mid-’60s left-wing group Mecki Mark Men, they began in 1967 as ", ", rebranded a year later as International Harvester (soon trimmed to just Harvester), and finally landed on what would be their best-known moniker, ", " (Trees, Grass, and Stones). In each incarnation, this wildly creative gathering of musicians, poets, artists, and writers made mossy improvised jams that began simply—a few chords, a basic beat, some singing—then trekked into the stratosphere.", "Since those heady times, the work of Pärson Sound and Träd, Gräs och Stenar has been collected into ", ", and now it’s International Harvester’s turn. ", " joins their two previously released albums with three discs of recently unearthed live material. Mapping the musical differences between the group’s iterations is somewhat futile, as they have many more commonalities than contrasts. This is especially true when comparing Pärson Sound to International Harvester, who shared the exact same six members. But the latter proved both a crucial fulcrum between past and future and a distinctive entity on its own.", "Where Pärson Sound were more overtly experimental—inspired largely by ", "’s minimalist trips and the corresponding experiments of co-founder ", "—International Harvester sometimes used traditional folk forms. They also were more political. In an interview in the notes of ", ", saxophonist Thomas Tidholm says their name was a critique of “Western profit-hungry engineering,” and some songs—such as “Ho Chi Minh,” which could’ve passed for a protest chant—were explicitly rooted in the events of the era. Their music was more timely too, dovetailing with hippified ’60s rock and hinting at the psychedelic strains that Träd, Gräs och Stenar would fully embrace.", "On their two proper full-lengths—International Harvester’s 1968 album ", " and Harvester’s ", ", from 1969—the group’s melange of interests and influences creates music that continually grows despite rarely deviating from initial repetitive sounds. They rarely changed key, or even chords. “Everything was usually left to evolve by itself and from itself,” Tidholm says. “It was all about listening, answering, filling in.” It’s a trippy thrill to hear how far the group can go without making huge moves, as if they’re playing their single-minded jams while sitting on a flying carpet.", "The most extreme example of this peculiar magic is “Harvest Times,” recorded in 1968 at the Nacka Aula auditorium in Stockholm. Clocking in at 25 minutes, it’s the longest piece on ", ", and it sure does take its time. A slow, lazy beat plods along for a good 10 minutes while small elements—vocal hums, horn bleats, stray guitar notes—wind around it. Eventually, the intensity increases, inch by inch, until the group generates a massive swirl of howling guitars and blasting horns. Despite its duration, the extended climax develops so gradually that it still sneaks up on you. The effect is similar to a drug high that doesn’t so much kick in as wash its way through you.", "There are other long songs on ", "—six of the 33 tracks last over 10 minutes—but this group could build arcs in smaller spaces too. Side one of ", " offers 11 shorter pieces and hits many highs: the straight-up rock riffs of “There Is No Other Place,” the atmospheric balladry of “It’s Only Love,” the proto-metal lurch of “It’s Getting Late Now,” the orchestral swing of “The Summer Song.” On ", ", the group stretches further, riding their repetitions into mantras. They indulge their sense of humor more too, playfully grinding out the drunken carnival song “Cock Polksa” and the woozy “Everybody (Needs Somebody to Love),” which evokes ", " traipsing through mud.", "All these sides of International Harvester get play on ", "’ three live LPs, which are on a par with the band’s two official albums. They even stretch the band’s purview, adding styles like the rootsy blues of “Dada Babble Boogie” and the cinematic woodwind essay “Blowing the Wind.” The more epic tracks, like the aforementioned “Harvest Times” or the 19-minute tower of psychedelia that is “Streets of Stockholm,” are complete works that could’ve been albums themselves.", "Throughout ", ", the group shows its jam-until-we-break-through approach to be so productive, it comes off less like jamming than spontaneous composition—perhaps even an eternal suite of variations on one vibrational theme. That may sound overly mystical, but it’s hard to listen to ", " and not believe that International Harvester tapped into something elemental."]},
{"artists": ["Alexis Taylor"], "album": ["Beautiful Thing"], "text": ["Hot Chip’s singer sounds caught in an irresistible haze on his latest solo LP, making music that’s more deluxe than usual but far scruffier than his main band.", "’s new album, ", ", begins with a slightly muffled, boompty beat, part throbbing of the heart and part pounding of a speaker heard through a bathroom door. “I’m dreaming another life,” Taylor sings, his voice quavering sweetly. “Won’t you meet me out of your mind?”", "Taylor has spent the last 15 years or so dreaming things up. As the lead singer of ", ", he imagined working-class British versions of American R&B (their 2004 debut, ", "), disco abandon (2008’s “Ready for the Floor”), and ’90s diva house (2015’s “", "”). Around and between those albums, Taylor formed the improvisatory trio ", " with members of ", " and widescreen junglists ", ". As a solo artist, Taylor has variously fancied drones; amiable odes to old pros like ", " and ", "; and most recently ", " of straightforward piano-man twinklers.", "Snatches of his discography waft throughout “Dreaming Another Life,” the opener to Taylor’s fourth solo album, as if before this dream he’d fallen asleep counting sleeves of his old records. It’s hypnotic but unsettled, stumbling from a warm passage of ambient house to loops of squalling noise to a glittering sheet of treated guitar. “The changes are hard to hear,” he sings, “but I know they hide in here/I’ll pull them together soon/Somewhere out of this thick air.”", "The title track arrives like a thunderstorm through billowing curtains. Created, along with most of the album, in concert with DFA co-founder ", ", “Beautiful Thing” boasts a bed of acid supporting unfurling swaths of noise, little winces of keyboards, and warm fluffy clouds of piano. “I try to reach you/But our love is undefined,” Taylor sighs, his voice caught in reverb. As with “Dreaming Another Life,” the song again and again starts to congeal, yet can’t quite become tangible. It’s the sound of Taylor caught in an irresistible haze, failing to slough away the sleepiness.", "Taylor picks up the kind of shrugging boogie ", " once put down for mid-album highlight “Oh Baby,” a kind of anxious paean to cohabitation. “There is nothing greater than the sight of you just dreaming free,” he sings as the chorus rises and falls, “and if I close my eyes I know that I will lose you when I wake.”", "And so, for the rest of the album, he sort of decides not to, tossing and turning in the throes of sadder songs. “Deep Cut” is a kind of ", " for the unemployed; “Roll on Blank Tapes” is something like if the On-U Sound System attempted a sea chanty; “I Feel You” approaches the grace of ", "’s “You Are My Sister” or “Thank You for Your Love,” without the aura of trauma.", "The layers of sound Taylor presents are sumptuous, full of tossed-off licks of piano and guitar that gather into motifs more deluxe than his recent solo work but far scruffier than Hot Chip. Tucked into them, Taylor’s lyrics make strange but welcome bedfellows. Often, he uses the language of music-making as a metaphor for connection. In the stately vocal showcase “A Hit Song,” he sings, “I need a high note/A moment to clear throats/Of all who have lost hope/And need a response.../And I know there is something left to lose/And high notes don’t always reach the truth.” There’s a catch in his voice like a dull sun through the blinds, capturing the moment of waking up and reaching out to find the pillow’s vacant after all."]},
{"artists": ["Jonathan Richman"], "album": ["I, Jonathan"], "text": ["Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today we explore the highlight of Jonathan Richman’s rich and varied solo career.", "When ", " was 19, he arrived at an epiphany in the Israeli desert. The scruffy salesman’s son from Natick, Massachusetts, was traveling after a short-lived stab as a solo musician in New York, home of his heroes ", ". There, in the miles of sand, gazing at a full moon, Richman had a vision: he would form a band. When he returned home he assembled the group that would become ", ", and their story is one of the greatest in rock. They helped invent punk and new wave, and they broke up before they ever released a record. Their brilliant self-titled debut, cobbled together from demos and issued in 1976, is acclaimed as one of the best albums ever.", "What happened immediately afterward is another great rock story: Just as the Modern Lovers’ belated popularity was cresting on the punk wave, Richman formed a new version of the group and pushed it in a different direction, with prominent acoustic guitar and what seemed like songs for children. By 1978, Richman and these Modern Lovers had parted ways, too, and here’s where some accounts of Richman’s decades-long career lose the thread. But he actually had some of his very best work in front of him.", "More than 40 years on, what happened ", " the Modern Lovers’ rise and fall might turn out to be the best Richman story of them all. He used his kid-friendly ditties from the late ’70s to hone in on a not-so-humble goal: to really connect with an audience by just singing what he felt. “People think that what I do can’t be done because it’s too simple,” Richman told art critic Kristine McKenna in 1980. “A lot of people think I’m being sarcastic. But if people can see that I’m not afraid to entertain them just by being myself—just walk up there and sing what I feel and they can dance to it, and enjoy it, with me doing nothing more than being myself—then that’s my mission.” Richman’s solo career can best be understood as a continual expansion of this quest, using intimate live shows to communicate joy and sadness with a stripped-down sincerity and generous charm. His fourth solo album, 1992’s ", ", is his defining recorded statement as a solo artist, and it offers a natural entry point into his scattered but rewarding catalog.", "The albums Richman had released in the ’80s and early ’90s had already gone a long way to challenge the widespread impression that his post-", " music was innocent or naive. His lyrics could be plainspoken or filled with wry wonder, but his best songs might be about standing up to nosy neighbors, say, or retaining individuality during marriage. In keeping with the improvisational, no-setlist nature of his live shows, Richman began to rework songs across multiple albums. He would also sing in different languages, dust off unexpected covers, and throw in the occasional moody instrumental. The approach to recording might vary, but the basic sensibility was strummy garage-pop with hints of surf, rockabilly, and doo-wop. ", " brought these strands together for a beach party so sparsely accoutered it could be dropped into your living room. And despite its title, the album took a village to create—there are about a dozen musicians credited overall. Richman told one interviewer at the time that the album was his best because he’d had so many friends helping make it.", "But ", " also succeeds because it places Richman’s solo-era whimsies firmly in the context of the one-hit wonders and uncompromising noise-rock that inspired him to make music in the first place. Throughout the album, Richman uses ’60s rock’n’roll tropes and images to illuminate his vision of a better life in the present. He gets right to point on the opening track, “Parties in the U.S.A.,” greeting listeners and declaring at that he’s “from the ’60s, the time of ‘Louie Louie’ and ‘Little Latin Lupe Lu.’” Though this song borrows shamelessly from the McCoys’ 1965 hit “Hang On Sloopy,” it tells a story about our increasing isolation from each other amid technological advancements. Richman isn’t longing for the old days, only the parties and the sense of connection they brought. It’s a feeling that hasn’t aged much in the 26 years since it was recorded.", " is full of these transformations, where something old starts to look new through Richman’s wise, wide eyes. In “Rooming House on Venice Beach,” he revisits a famous L.A. hippie haven but what he remembers are early-’70s holdovers—drunks, beardos, weirdos—and a dirt-cheap crash pad right next to the ocean. “It was wild and free,” he concludes the hiccupy boardwalk romp, “and that appealed to me.”", "An even bigger revelation is found in the rickety ", " crunch of “Velvet Underground.” The song explains, in terms a child could understand immediately and an adult can spend a lifetime pondering, how a work of art can be so personally moving. VU’s “Sister Ray” is, famously, a 15-minute feedback dirge with lyrics about injecting heroin and sucking on someone’s ding-dong, and it’s also the song that influenced a teenage Richman to write the chugging guitar part to the most enduring Modern Lovers song, the nervy highway anthem “Roadrunner.” In “Velvet Underground,” he celebrates the band for being not only wild and free, but also for creating their own unmistakable atmosphere, and for describing the world they saw vividly without flinching. When he works bits of “Sister Ray” into his own song, it’s a strange and beautiful tribute from the closest person they ever had to a protégé.", "Sometimes Richman refreshes the familiar just by bringing the song’s concept into the modern age. Disheveled stomper “You Can’t Talk to the Dude” sympathizes with a woman who’s stuck in a doomed relationship with a guy who won’t share his feelings—not a common ", " compilation theme, as I recall. With low-tech sound effects, “Tandem Jump” updates novelty surf-rock for a world where there’s skydiving, and the effect is positively exhilarating. “I Was Dancing in the Lesbian Bar,” perhaps Richman’s best-known solo song, borrows liberally from ", "’ “Gypsy Woman,” but this ode to un-self-conscious dancing happens to take place in a venue where older songs couldn’t dare tread. It’s pure ", ", political merely by its existence, and its sweetness spreads through a crowd as surely as if they were standing downwind from a chocolate factory.", "As the songs unspool, ", " continues to find inventive links between Richman’s past and present. “A Higher Power” channels the Lovin’ Spoonful’s belief in magic and finds proof of its existence in what seems to be Richman’s real-life romance (“I knew it from afar in that lonely rock and roll bar,” he sings, a description that matches how he reportedly first saw his then-wife Gail). “That Summer Feeling,” one of Richman’s most gently devastating songs, is about knowing that the good old days really weren’t, but finding yourself longing for those sensations anyway. On the dream-like closing track, “Twilight in Boston,” where Richman vividly narrates a walk through his long-ago stomping grounds, he signs off, “Time for adventure.”", "After ", ", Richman’s solo act slowly gained a cultural foothold. In 1993, “Saturday Night Live” cast member Julia Sweeney did an endearing interview with him for ", ". That same year, Richman was the second-ever musical guest on “Late Night With Conan O’Brien,” after ", ", and he’d appear on the show several more times, including the YouTube-famous performance of “I Was Dancing in the Lesbian Bar.” By the end of the decade, those ’70s kiddie songs like “I’m a Little Airplane” had become staples on “Sesame Street,” and Richman had appeared in two Farrelly Brothers films, most prominently as a Greek chorus in ", ". He divorced and remarried, kept touring and, every now and then, he quietly released an album, many of which are very good.", "Richman’s work is about being fully present in the moment with other people, and that’s difficult to capture in a studio for all time. But ", " is as close as he’s come, and it’s a perfect gateway to all that his music promises. In recent years, he has revised the Modern Lover’ “Old World,” which originally took aim at hippie drug culture by declaring his love for his parents and full engagement with reality; now he clarifies, “I don’t want to go back to the old world,” what with its “mustard gas and women not being allowed to vote.” Just this year, when an interviewer asked Richman about a much-circulated 1973 letter he’d sent to ", " titled “Masculine Arrogance Blows,” he admitted to still having to work on that arrogance in himself.", "Richman challenges us to experience pain and pleasure at their fullest. To embrace progress, but not when it dehumanizes us. To be ourselves completely, in the knowledge that we’re all in this together. To be free, like “Roadrunner”: ", ". He has been dissected by gifted critics from Lillian Roxon and Lester Bangs to Ellen Willis and Greil Marcus, but the most illuminating writing I’ve found about Richman’s ", " era comes from the closing line of a ", " concert review: “He simply played and sang with love and joy, and he made his audience feel good.”", "Richman recently translated a book of Italian poetry, by the Bologna-based writer Alberto Masala. A blog post announcing the project includes these verses: “An old man went every night to sing the sunset in a cave on the mountain top/And every night a child followed him to observe him from a distance. One day the child asked: ‘You sing alone. Your people are scattered, broken up, exterminated by alcohol, fatigue, hunger, drugs, prison… Now only they speak the language of the empire, and are not even able to understand you… they laugh at you… why do you continue to sing? You’re left alone…’/The old man replied: ‘If I do not sing would mean that they also took me.’” They haven’t taken Richman yet."]},
{"artists": ["John Maus"], "album": ["Addendum"], "text": ["Presented as a companion piece to last year’s ", ", John Maus’ latest captures the avant-garde artist at his most irreverent and unguarded.", " doesn’t want you to mistake his smarts for being pretentious. Sure, the cultishly adored synth-pop performer holds a Ph.D. in political philosophy and he isn’t afraid to expound on subjects like Freud, the Enlightenment, and Michel Foucault’s ", " in interviews that often read like thesis excerpts. But he also loves cartoons, preaches his admiration for pop music in its most accessible forms, and ", ", that he unwittingly participated in an alt-right Adult Swim program because its creators also hated TED Talks. He’s weary of coming across as the ", " of avant-garde music. For his last album, 2017’s ", " he built his own modular synthesizers—the act of a truly devoted audiophile—only to dismiss the exercise as a waste, later on admitting that only “about half a dozen of only the most discerning ears would make out the difference.”", " caught Maus in an even dourer mood than usual, playing up the gloom in his deadpan voice with songs about battlefields, executions, and societal rot. It was as odd and indelible, even though it was a commonplace totem of 2017: the Trumpian despair album. It turns out that record’s apocalyptic imagery and stark mood didn’t capture the totality of Maus’ headspace at the time. Recorded during the same sessions as ", ", and on those same homemade synths, its companion piece ", " captures Maus at his most irreverent and unguarded. Artists of Maus’ intellect aren’t supposed to just fuck around—it’s assumed their work must contain layer after impenetrable layer of meaning. But as often as not on ", ", it kinda feels like he’s just fucking around.", "The bleaker the album’s subject matter, the more overt the comedy. Where ", " had a song about dead pets, ", " counters with a robotically funky one about dumpster babies (“Take that baby to the dump/To the dump!”) that plays like the imagined soundtrack to a demented Atari game. His surly baritone sounds less ", " and more the guy from Right Said Fred, and throughout ", " he plays it for maximum absurdity. “They don’t know shit about outer space” he huffs over neon-hued keys on the opener “Outer Space,” a cross between the sensibilities of ", "’ “", "” and ", ". With its treadmill pace and chants of “Run! Run! Run!,” the manic “Running Man” seems to exist mostly so listeners can picture the dance that might accompany it onstage.", "By nature of its title and packaging—the album is being pressed only as part of a career-spanning box set ahead of a digital release—", " risks being classified as a second-tier Maus record. Maybe that’s by design, but Maus has saved some of his best work for ", " before, and leftovers or not, this material stands on its own. Only “Privacy,” a smoldering buzz-killer written by ", ", feels like a draft of a song that never quite jells into the pop spectacle it wants to be. But a pair of closing songs written back in 2003 are two of the album’s most spirited. With its feverish drum claps and revved-up synths, “1987” plays like Maus’ curmudgeonly response to the party-starting dance-punk of the early 2000s—his disdainful recitation of the word “sexy” during its breakdown ranks among his all-time great line readings. Maus has made more profound and mysterious records, but never one that has taken this much delight in its own ridiculousness."]},
{"artists": ["Post Animal"], "album": ["When I Think of You in a Castle"], "text": ["This Chicago six-piece plays heavy, proggy psychedelic rock with just the right amount of power-pop sugar to sweeten the mix.", "Psychedelia comes in many guises, and Post Animal wear just about all of them. The Chicago sextet’s debut, ", ", is a practical travelogue through the genre’s more melodic and explicitly rock-y incarnations, tempered with just the right amount of brawny power-pop. At times, they resemble the ’70s-radio dreams of ", " and ", ", or an alternate-universe ", " that came up in Athens, Georgia’s storied Elephant 6 collective instead of the pubs of Dublin. The band’s previous EPs—", " from 2015, and 2016’s ", "—leaned hard on haze and fuzz, and while those elements are far from absent on ", ", there’s a new sense of clarity and realization. As far as first LPs go, it’s shockingly confident.", "Among the members of Post Animal is actor Joe Keery, whom you might recognize from the depths of your Chromecast as “Stranger Things” ", " Steve Harrington. The six musicians in the group collectively share writing credits for the album, and they frequently swap lead vocal duties, so Keery’s contributions wouldn’t necessarily stand out—except for the fact that his other gig almost prevented Post Animal from continuing at all. “We weren’t sure what the future of the band was going to look like,” drummer Wesley Toledo states in a one-sheet. “We didn’t know where we were all going, but we knew we wanted to make an album with all of us in the same room.”", "Good thing, too: A self-produced effort recorded in a cabin by Michigan’s Paw Paw Lake, ", " at its best resembles six guys jostling for elbow room as they pile colorful, blocky riffs atop one another like an intense game of Jenga. “Heavy” is an adjective often applied to variants of psych-rock and pop, and Post Animal often sound like they weigh a thousand tons, breaking into doomy sludge in the middle of the dizzying “Gelatin Mode” and melding Toledo’s arrhythmia-inducing bass hits and Keery’s frantic vocals on “Dirtpicker” to create an endlessly building, ziggurat-like effect.", "If those descriptors sound like they hew closely to the nerdy sonic calculus of prog rock, you’re not too far off. Mountain-scaling arpeggios and showy chord progressions are practically in the band’s DNA, and there’s a sense of old-fashioned skill emanating from ", " that is, at times, gloriously unfashionable compared to the current indie rock landscape. But focusing on Post Animal’s considerable chops also risks overlooking the band’s impressive skill for crafting memorable melodic baubles. Dalton Allison’s satisfying high register punctuates the turned-loose drum solos and stop-start breakdowns of “Tire Eyes,” and “Ralphie” opens up from a six-stringed air raid to reveal a sweet power-pop gem with interlocking vocal hooks crafted to raise your blood sugar levels.", "Despite being a clear album standout, the panting horndog-isms of “Ralphie” also represent Post Animal’s true Achilles heel: They may have no trouble getting creative musically, but their lyrical content isn’t quite as inventive. The band recently admitted in ", " that the lyrics of “Gelatin Mode” are essentially interchangeable placeholders, and Post Animal’s subject matter—generally falling into the two broad categories of lusting after women and expanding your mind—confirms the impression that words aren’t their focal point. This is, for now, fine; there’s a long legacy of psychedelic music where what’s being said is of far lesser concern than what’s being played. But the lyrical efforts from some of Post Animal’s clearest predecessors—", "’s saucer-eyed apocalyptic visions, the Magic Eye-like emotional anxiety of ", "—highlight the fact that this band has nowhere to grow but up."]},
{"artists": ["Shuggie Otis"], "album": ["Inter-Fusion"], "text": ["The L.A. psych-soul artist’s first album in more than 40 years is a plodding, overdriven blues-jazz odyssey that feels like a chore.", "Cut ", " some slack. After decades in the wilderness, the L.A. native is finally enjoying the acclaim and attention that eluded him the first time around. His second act started in 2001 with an acclaimed Luaka Bop reissue of his haunted ’70s psych-soul classic ", ", and kept going with re-releases of his other studio albums from that era. The man who was once a small mystery, known only to hip-hop producers and anyone who looked up the writing credits for the Brothers Johnson’s ", " of his “Strawberry Letter 23,” is now able to play stages around the world. It’s an appealing story of redemption—which in some ways makes it even more disappointing that Otis’ first collection of new music in over 40 years is such a chore to listen to.", " is the kind of plodding, overdriven blues-jazz odyssey that Otis has occasionally hinted at during his recent run of live performances. He shows no interest here in touching on the zonked-out brilliance of ", " highlight “Happy House” or the deep funk of his 1970 debut, ", ". Instead, he calls back to his early days backing up his father, ’50s R&B pioneer Johnny Otis, and perhaps previews a future showing off his instrumental virtuosity in bars.", "That facility with a guitar is the one element that Otis really has going for him on ", ". He attacks each song ferociously, peeling off solos that are just showy enough to prove why he was qualified to jump in the fire as ", "’s bassist on “Peaches En Regalia” at age 16. His fuzzed-out breakdowns on a meaty re-recording of “Ice Cold Daydream” (originally found on his 1971 album ", ") crack through the light funk groove nicely, kicking out a subtle nod to ", "’s “Third Stone From the Sun” for good measure. And each song is anchored by his sturdy yet flexible rhythm work.", "What Otis needed was a creative partner who could help him plot a course between the extremes of his past achievements and whatever he’s attempting here. Instead, he hitches his star to Kyle Hamood, a member of L.A. rock nobodies Them Guns, who buffs and polishes every last inch of ", " until you can practically see your reflection. Otis cedes almost all control to the producer and the rhythm section—drummer Carmine Appice and bassist Tony Franklin, both studio lifers—letting them write all the songs and clutter them up with showy fills and sickly synth tones. It’s enough to make you wish someone had given him ", "’s number instead, or Daptone Records leader Bosco Mann’s.", "There’s no getting around the fact that ", " is a missed opportunity. For all its failings, though, at least Otis sounds engaged with the material—he’s having fun, even if no one else is. This isn’t the leap forward fans might have hoped for, but if it gives him the momentum to keep writing and recording, that’s better than nothing."]},
{"artists": ["Smokepurpp", "Murda Beatz"], "album": ["Bless Yo Trap"], "text": ["Lil Pump’s wingman goes through the motions on an aimless, half-baked new 10-song mixtape with “Nice for What” producer Murda Beatz.", "Miami rapper ", " is best known as ", "’s wingman and understudy, the tag-team partner ", " at shows—a strung-out-seeming, ", " wildman in ", ". He’s the 20-year-old madcap with a ", " tattooed on his stomach, a ", " reject fit for casting in a “Jackass” reboot. There isn’t much else that defines him, and his unruliness doesn’t really enhance his impersonal music. When people talk about SoundCloud rap, a term that’s quickly becoming a catch-all for an entire generation of young rap refugees, they’re speaking specifically about rappers like Purpp. If he’s not ", " as G.G. Allin or proudly declaring his music “", ",” he’s staring dead-eyed into the void and rapping in circles about nothing in particular. On the heels of his 2017 debut, ", ", he’s released ", ", a 10-song mixtape made in collaboration with buzzing Canadian producer Murda Beatz. The main thing he accomplishes in its 23-minute running time is exposing himself as a wash-out simply going through the motions.", " takes its name from a ", " cut that felt like a ritual for the Trap Gods, an unholy offering to ", " and ", ". The tape lacks that energy. Murda and Purpp made almost the entire project ", ", and it sounds just like that—in the spirit of SoundCloud, the reason this exists is simply ", ". Half the songs on ", " feel halfway finished, rapped without purpose and released into the world with a shrug. Four of them clock in under two minutes, continuing rap’s ongoing obsession with ", ".", "Like his friend Pump, Smokepurpp needs his songs to be over as quickly as possible. He isn’t quite as committed to unrelenting motion, but his verses are just as empty and unproductive. Where Pump can occasionally thrill, Purpp is mostly stupefying. His punchlines don’t have set-ups, and sometimes he bails out on his own ideas midway through stating them. On most songs, he doesn’t seem to even be following a specific train of thought—he’s pretty much just rambling into the mic, as if he’s been asked to present a project on the spot by a teacher who caught him sleeping in class.", "Every once in a while he stumbles upon something mildly droll (“Your bitch tryna find the circumference/And I got hoes in abundance,” or “I don’t wanna fuck I tell her suck my watch”) or wanders in a somewhat interesting direction, as on “Pray”: “My Fiji and diamonds the same thing/Scope on that bitch it got good aim/Choppa make a nigga do the rain dance.” But the songs are all circuitous, often taking roundabout ways to say the exact same things about the color of his diamonds, the nature of his shootouts, or which drugs he’s doing in which designer outfits. His verses are the rap equivalent of Mad Libs. In certain situations, Purpp’s aggro raps seem to channel bluntness, chasing an “idgaf” punk aesthetic. But on ", ", his rapping is simply artless and unimaginative.", "The X factor on this project should be Murda, who, having produced hits for ", " (“Portland”), ", " (“It’s a Vibe,” “4 AM”), ", " (“", "”), and ", " (“Butterfly Effect”), broke through even further earlier this week with Drake’s “", ",” the current No. 1 song in the country. Murda is a versatile beat maker with undeniable instincts; without him, this effort would be a lost cause. His talents can be felt in the spooky synth throb on “123” and the metallic strobe of “Do Not Disturb.” But his beats don’t suit Purpp the way Jersey pioneer (and SoundCloud rap architect) ", "’s distorted bass abstractions do. The life expectancy of these songs isn’t much longer than the time it’d take to face a blunt.", "There’s little on ", " to suggest that Smokepurpp has much room for growth, and there’s even less to suggest he cares about that. He’s unbothered and myopic, as many are at his age, stoked to be handling more money than he knows what to do with, simply for turning stunts into songs. “Everywhere I go I keep that thang on me/In the club I flex on niggas that are older than me,” he raps on “For the Gang,” which seems to be the general idea: He’s young and he’s already richer than the adults around him, and he got that way doing what he’s doing, so why stop? Which, fair. Purpp isn’t completely incompetent—he’s finding his way around melodies and he is capable at mimicry—but the time is coming when he runs out of tricks, when being able to ape the sounds of the moment won’t be enough, when “SoundCloud rap” itself is another long-forgotten tag on blog posts. ", " suggests that time is rapidly approaching."]},
{"artists": ["The National"], "album": ["Boxer (Live in Brussels)"], "text": ["In 2017, the National revisited their 2007 classic ", " at a show in Brussels, and the set has been packaged for a Record Store Day release. You had to be there...", ": classic stuff, definitive album for one of the definitive indie rock bands of 21st century. One of the best live bands too. ", " curate festivals and ", " ", ", ", "’s relationship with his brother was deemed a worthy subject for a critically-acclaimed documentary, they’ve been this close to debuting at #1 on Billboard and ", " in a category that actually gets televised. It’s been a very, very long time since the National actually had anything to prove, and yet they take the stage as the same Cincinnati transplants who spent years getting ignored in New York long before their infamous tour with ", " show. It’s easy to imagine them spending each pre-show reading and internalizing every backhanded compliment about their erudite image and fanbase and getting back into that 2005 headspace. Oh, and the city of Brussels seems pretty awesome too. So it’s hard to rate ", " both as an actual experience and as a recorded document of music. I would have paid a significant amount of money to watch Boxer live in Brussels, and not a single dollar for ", ".", "At the very least, ", " keeps most of its promises—", " played in full, in order, with no encores or stage banter indicating it was indeed recorded in Brussels and not the CalCoast Credit Union Open Air Theatre or Verizon Hall or any other late-2017 tour stop. “This is a ", " record,” Berninger jokes at the end of “Guest Room,” before mentioning the tendency of grammar-minded fans to hear the title of the next song as “Racing Like a Pronoun.” That’s about it. And so the utility of ", " is less about whether the National ", " on any of the originals so much as offer something different than an album that has been a fixture for the entirety of its existence.", " inevitably capitalizes on the personal nostalgia driving any 10-year anniversary year celebration—the night you got way too drunk and sung “Fake Empire” in a cab home, the night you got way too drunk and listened to “Slow Show” while scrolling through ex’s Facebook profiles, and so forth. It also skews the global context of ", " and shows just how much it was a product of its time. “Fake Empire” is technically the National’s biggest hit, so it at least ", " weird as the opener of a live set in 2017. It sounds a little jauntier, less solemn than it did originally—it was released towards the very end of Dubya’s second term, after all, where more hopeful times were clearly in sight. Were it written for 2018, “Fake Empire” would be both way too on-the-nose and too obtuse. “Mistaken for Strangers” likewise took on a very time-specific kind of sociopolitical heft shortly after its release and feels weirdly quaint in retrospect: a portrait of “economic anxiety” when that term felt like less of a coded euphemism. The central metaphor of “Start a War” was daring, but not insensitive. Those songs still feel like ", " falling apart, not an entire society.", "But that’s all taken care of in the first seven minutes and in all likelihood, the Brussels crowd is not here to reassess ", " as a document of slow, steady American decline. It then falls to the individual to scavenge ", " for any new wrinkle: horn sections are a luxury for bands playing a hometown gig or a festival, and the National is big enough to mandate one at just about any show. These horns were on Boxer too, and when the coda on “Fake Empire” catches the beat differently than it does on the album, it's a papercut-subtle change that drives me nuts. “Mistaken for Strangers” runs a little breathless and ragged, Berninger occupying the space of the beleaguered desk jockey rather than an omnipotent narrator whose judgment feels comforting—this adult life is unmagnificent, it’s not just you. The studio version of “Squalor Victoria” is the shortest song on ", " and it’s the longest one on ", ", whipping up a turbulent outro, the only time Berninger screams on something written after 2005. And if you’ve seen the National at any point in the past 10 years, this is the exact version of “Squalor Victoria” you’ve heard every single time.", "As avowed ", " fans, it’s not surprising that the National would eventually leverage their live reputation into a burgeoning cottage industry—you wonder why it took them this long. But there’s nothing cynical about ", ", and it’s being released on Record Store Day, where 98% of the available goods are clearly “collector’s only” artifacts. Sure, it’s ", "’s time to celebrate its birthday, and yet it’s the National album that’s the least revelatory in a live setting. ", " will forever be the National’s enduring document as underdogs and the way some people will always want to see them—there’s no way we’re ever getting back the guys who made “Mr. November” and “Abel.” The claustrophobic, dense production that made ", " such a convincingly difficult comedown record was off-putting to some and seeing “Terrible Love” once will make you understand why it managed to replace “Mr. November” as their perennial set closer. ", " is still kind of a grab bag, but loose—the most “live” National record, and even if ", " isn’t as energetic as their past work, it’s worthwhile to see how they get to play with their new toys.", "And then there’s ", "—the one with the tightest songs, the most exacting arrangements, a muted Side B. Yeah, “Gospel” and “Guest Room” are the kind of fan-favorite deep cuts that likely got retired from setlists once ", " dropped and that deflated horn outro of “Mistaken for Strangers” will always take me right back to those days of eating another lonely dinner in my cubicle at 7:30 PM during a 14-hour day that hasn’t ended yet. But more than any National album, ", " needs the things that make these guys such compelling live theatre—listening to a record, you can’t see Berninger take mighty pulls from a bottle of wine and lose himself in the din during the instrumentals, nervously pacing, head-down like so many of his narrators. There are no covers, no possibilities of “Cherry Tree” or “Cardinal Song,” no way to fully appreciate the intense physicality of the Devendorf and Dessner brothers’ instrumental compositions. None of which is to detract from the National’s live reputation, mind you. ", " does the opposite, reminding you of all the fun you’re not having."]},
{"artists": ["Yazan"], "album": ["Hahaha"], "text": ["On his first album for Exploding in Sound, this son of Palestinian refugees takes his humanistic blues-folk in a more energetic direction.", "Growing up in New York City during the ’80s as the son of Palestinian refugees, Brooklyn singer-songwriter Yazan absorbed peace and justice as his core values through conversations with his parents and education at the United Nations International School. He’s spent the last few years putting those ideas into music, deconstructing how first-world privilege works in his barebones folk and blues-rock songs. It’s a sound and ethos that fits in well with the idiosyncratic indie championed by Exploding in Sound Records, where Yazan has recently found a home alongside peers like ", " and ", ". On ", ", his third album and first on the label, he begins looking outward, both by trying to engage outsiders and by questioning his own motives.", "Yazan has said he hopes to startle the complacent into action by shedding light on life problems big and small. It doesn’t get much smaller than “Cockroach,” a sweeping and boisterous rock ballad that trudges in time with his vocal trills. He wrote the song after a literal bug crawled through his practice space and someone squished it under their boot, leading to a moral spiral about the imbalance between the sanctity of human life and that of insects. Elsewhere, he calls out the false power of fear-mongering or, on the title track, laughs his way through shared anxiety while Pile drummer Kris Kuss takes a detour into ’60s psych. Even “The Star,” where Yazan imagines a world not driven by war, contradicts itself by employing heavy, ", "-inspired chords. For an album bent on spreading harmony and understanding, ", " feels delightfully manic.", "That restless ambition winds up blurring many of the album’s details. All nine songs on ", " offer stacks of robust guitar and a disorderly splendour that at its best recalls ", ", but too often they wander off as if caught up in their own optimistic high. “Do You Wanna Go?” embraces the openly gaudy appeal of shredding, but keeps pushing a fun guitar solo after it’s already gone far enough. The intentionally plunky number “Forgiveness Begins” offers a friendly reminder about self-forgiveness, but clumsily waltzes through a key change and extended outro that adds little benefit to the message or the melody.", "This kind of emotional rambling fit on Yazan’s earlier records, where it was part of the complex blues-folk scenery. But when he tries to keep up with the rhythm-backed instrumentals of ", ", he ends up outshining his own points. Those stylistic differences are made obvious when Yazan pivots back to a more Americana-based approach: The message of “When I’m Gone,” about the importance of self-preservation when ending a relationship, is easy to absorb over its rolling roots guitar melody. The same is true for the love song “Ghost Blues,” a song so straightforward in its dark baritone storytelling that it could double as an homage to ", ".", "Though its humanistic messages occasionally get lost in feeling, ", " captures Yazan’s gutsy, freewheeling positivity, and does it with enough energy to make you want to believe in what he preaches. At this album’s best, he brings his humbling practice of peace and acceptance to life in a harsh, scruffy, and very human sound."]}
]